[
  {
    "url": "https://scroll.in/article/1081731/the-challenges-of-makhanas-rapidly-rising-appeal-in-india",
    "title": "Fox nut: Thorny challenges of the makhana’s appeal",
    "content": "agricultureThe challenges of makhana’s rapidly rising appeal in indiaFox nut has become a ‘superfood’ packed with protein. But cultivating it is labour-intensive process with low earnings.Aditya AnshMay 01, 2025 · 07:30 pmRead in AppNipun Haldar via UnsplashMakhana, also known as fox nut or lotus seed, has been around as a snack for a long time in India. However, in recent times, makhana, often promoted as a superfood high in protein, has seen a significant surge in popularity.Makhana are the edible seeds of theEuryale feroxplant, a type of water lily that grows in stagnant ponds and wetlands. While it is primarily cultivated in Bihar, it is also found in parts of East Asia.Farmers in Bihar’s districts such as Darbhanga, Mithila and Madhubani have cultivated fox nuts in waterlogged fields and shallow ponds. Once harvested, the seeds are dried and roasted.Temple offering to global marketIn India, this superfood has had cultural significance through the decades. It was offered in temples and also used in fasting rituals. “Makhana has also served as a gift in Mithilanchal (region of Mithila) weddings, symbolising purity and prosperity,” says Ramanish Thakur, from TirhutWala, a Bihar-based manufacturer of makhana.In 2023, the global fox nuts market stood at $44.4 million and by 2030, it is projected to reach$97.5 billion, with India, the largest producer, contributing a significant share, accounting for over 81% of the global revenue.Earlier this February, at a rally in Bihar, Indian Prime Minister Narendra Modi had also publicly endorsed the snack, highlighting its nutritional benefits. Further, the nut also found a spotlight in the 2025-2026 budget after the government announced that aMakhana Boardwould be established in Bihar to increase production, ensure fair trade practices and support farmers with better market access.Fox nut, locally known as makhana, roasted for consumption. Credit: Image by FacetsOfNonStickPans, CC BY-SA 4.0, via Wikimedia Commons.Once a traditional snack, these nutrient-rich nuts have now found a place alongside kale crisps and quinoa chips on grocery shelves, globally. While fox nuts are also cultivated in countries such as Japan, China, South Korea and in Russia, India leads by a long way in production and exports, accounting for nearly90% of the world’s makhana exports.However, this rising appeal is fraught with numerous challenges.Labour-intensiveThe cultivation of makhana is a labour-intensive process that requires wading through knee-deep muddy waters, collecting prickly black seeds from pond beds. The workers are required to use long sticks to move the plants, which remain submerged in mud for at least a month. These seeds then go through a thorough cleaning process, are sun dried and roasted.At an initial glance, the plant resembles a lotus, but a closer look reveals sharp thorns that make harvesting physically challenging. “The thorns sometimes hurt the farmers, but their earnings depend on this harvesting,” says Rakesh Jha, a farmer of fox nuts from the Mithila region.There have been instances when landowners would lease out their ponds to labourers for cultivation of the nuts. “However, they would take 50% of the total profit, leaving farmers with only a fraction of their hard-earned earnings”, says Jha.Speaking about the process, Jha says that around 10 workers roast over a 100 kg of nuts, of which only 30 kg-35 kg pop.A makhana field in Madhubani district, Bihar. Farmers across the state must wade through knee-deep waters in such waterlogged wetlands to harvest makhana, or fox nuts. Credit: Shambhu Prasad.Unlike rice or wheat, where mechanisation has eased the process, cultivating makhana crops still heavily relies on manual labour, making it both physically draining and time-consuming. “The manual labour involved in the process is exhausting and there has been no innovation in equipment,” Thakur says. “There is no machinery available for body protection as well and this impacts farmers’ health by exposing farmers to cuts and stings leading to infections, and long-term physical strain from labour stricken tasks.”A study conducted in the Darbhanga district revealed that theaverage cost of cultivation per hectare is approximately Rs. 109,395.70with an average yield of 2,037.5 kg per hectare.Human labour, however, constitutes for about 35.75% of the total cultivation cost, highlighting the labour-intensive nature offox nut farming. Even after the high returns, farmers in Bihar continue to face significant price volatility in recent years.In 2022, the price of popped makhana fell driven by hoarding. Many farmers held onto stock from previous season when sales were low leading to a sudden influx of old produce into the market that caused oversupply. The prices dipped from Rs. 400-500 per kilogram to Rs. 250-300 per kilogram. “The rate earlier for farmers was around Rs. 300 per kilogram and at most Rs. 500 per kilogram,” Thakur adds. “Now, farmers are able to sell to us at almost Rs. 1,000 per kilogram.”According to government data of 2023, Bihar’s poverty rates stood atapproximately 33%. A large population in the state lacks access to education, basic sanitation and health facilities, and employment that forces them to migrate. Most of the farmers traditionally make earnings through the cultivation of rice and wheat, which is not enough to survive.A farmer cultivates makhana. Cultivation is a laborious and often hazardous process. Workers lack appropriate equipment, using long sticks to move the plants, whose sharp thorns cut farmers, leading to infections. Credit: Shambhu Prasad, via Mongabay.Farmers who cultivate makhana often struggle with lack of market education and awareness, which in turn allows intermediaries to dictate prices.“Most of us lack education and are unaware of how much we should sell the makhana for,” says Kumar, who has been involved in farming of fox nuts since a decade in Darbhanga, Bihar. “Middlemen decide the price, we do not have much say. Sometimes we do not recover what we spent during the harvest, but hopefully it will change now as demand and awareness is increasing”, mentions Kumar.“The biggest challenge with makhana is harvesting, which is highly labour-intensive,” says Manish Anand, founder of Mithila Naturals, manufacturers for the nuts. “Progress is being made and there should be some machinery in the next two years. Bihar also undergoes a pattern of seasonal labour migration.Can India stay aheadChina’s growing influence in global markets has flagged concerns about competition in the makhana industry. A special kind of fox nut called “Qian Shi” has gained popularity in China for claims about its medicinal purposes.Many like Prasad are confident in India’s stronghold position in the market. “We are planning to bring in a lot of innovation in this field,” he adds.IMAGE: Freshly harvested black makhana seeds, ready to be dried and roasted before being sold. While the seeds held cultural significance in India, they are now consumed globally as a superfood. Credit: Shambhu Prasad, via MOngabay.Market manipulation is another major hurdle by certain players who want to exploit the industry. “They [the competitors] just copy our packets and change the name,” Prasad says. “Counterfeiting of established brands is emerging now because of increasing global presence [of the foxnut],”Frequent manipulations like these often end up misleading the consumers and disrupt the industry creating instability in pricing and availability, thus affecting farmers.This article was first published onMongabay.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.Fox nutsAgricultureFoodEnvironmentLabourRelatedThirsty crops, tired soil: Vicious loop threatens India’s food and water securityTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081777/low-investment-several-years-too-late-why-india-lags-far-behind-china-in-tech-innovation",
    "title": "Low investment, several years too late: Why India lags far behind China in tech innovation",
    "content": "Indian innovationLow investment, several years too late: Why India lags far behind China in tech innovationIndia’s services-led mindset and decades of underinvestment in innovation have left the country scrambling to catch up in the global tech race.Furquan Ameen, Rest of WorldYesterday · 09:00 amRead in AppJishnu Bandyopadhyay for Rest of World.This article was originally published in Rest of World, which covers technology’s impact outside the West.China’s DeepSeek moment has triggered unease for the Indian government and tech industry.Earlier this month, India’s commerce minister, Piyush Goyal, rebuked the country’s entrepreneurs for their lack of innovation. “We are focused on food delivery apps, turning unemployed youth into cheap labour so that the rich can get their meals without moving out of their house. And against that, what does a Chinese startup do? Work on developing electric mobility battery technologies, and with that, they today dominate the electric mobility ecosystem,”Goyal saidat an industry event.Goyal’s comments sparked abacklashfrom Indian startup founders and investors, who pointed to bureaucratic red tape and import regulations on computing equipment as major barriers to innovation.While explanations vary for why India – where startup funding isamong the highest in the world— has fallen behind in advanced manufacturing and artificial intelligence, experts believe the gap dates back to the 1980s, when the two nations diverged economically: China invested heavily in manufacturing, while India leaned into services.Today, Chinacommands30% of global manufacturing output, while India lags at 3%. India’s services-led mindset and decades of underinvestment in innovation have left the country scrambling to catch up in the global tech race, according to industry analysts, government stakeholders, and academics.“China’s ecosystem is different. They already have the manufacturing prowess, which they built over time. So, for them to make a product which can be put into the market is not that difficult,” Pranay Kotasthane, chair of the High-Tech Geopolitics Programme at Takshashila Institution, a Bengaluru-based think tank, toldRest of World. India remains a “service-focused” tech ecosystem – a space where the country beats China “hands down,” he said.The government is counting on the private sector for high-tech innovation, Abhishek Singh, a top-ranking bureaucrat and CEO of IndiaAI Mission, a state-led initiative to drive AI adoption, toldRest of World. “The government can only enable the ecosystem. The actual work is done by the industry, startups and researchers.”India has not innovated like China due to “a lack of conviction at scale,” Anant Mani, founder and CEO of a Chennai-based artificial intelligencestartup, Randomwalk AI, toldRest of World. “India’s AI startup ecosystem is alive, but not yet formidable. We have sparks – Sarvam AI, Niramai, Krutrim AI, etc – but not yet a sustained fire.”India hasover 200 generative AI startups, whichraised $560 millionin funding in 2024.Yet, India is a net exporter of top AI talent, while China, despite producing nearly half as many high-quality researchers, retains most of them within its domestic ecosystem, according to a global AI talenttrackerby Chicago-based think tank MacroPolo.Despite losing much of its top AI talent to the US and Europe, India is still home to over 20% of the world’s semiconductor design engineers, Kotasthane said. The leading 25 semiconductor companies in India with centers dedicated to design and research and development include global giants like Intel, Nvidia, and Qualcomm,accordingto the Information Technology and Innovation Foundation, a Washington-based science and technology think tank.But India’s investment in innovation is meagre, undermining its ambition to take on China. India spends 0.64% of its GDP on research and development, farbelowChina’s 2.4% or the US’s 3.5%.“The Indian mindset is that Silicon Valley is an extension of ours,” Payal Arora, a digital anthropologist and professor of inclusive AI cultures at Utrecht University, toldRest of World. “We export the majority of brains to the US, where they become leaders and create offshore places like [Bengaluru]. … They are not Indians representing India in the US … They’ve become Americans and are serving American interests.”The Indian government, in arecent survey, pointed out that private sector investment in research and development remains consistently low compared to countries like China, Japan, and the U.S.China’s Huawei alonespentnearly $23 billion on research and development in 2023 – more than India’s total public and private spending combined. In the fiscal year ending 2023, India’s top spenders, Tata Motors and Reliance Industries,spentRs 23,265 crore (around $2.8 billion) supporting tech innovation.“This is all capex [capital expenditure], which is very high-risk because you are doing the capex up-front in the hope that you will create something truly differentiated at a global scale,” said Ravi Jain, investment director at TDK Ventures – an arm of a Japanese tech company that invests in AI – and the former business head of Indian AI startup Krutrim AI. “The chance of this coming through is very low because somebody will have to write a 100, 200, 300 million-dollar check up-front to be able to even get started in this pursuit.”As part of its $1.26 billion IndiaAI mission, launched in March 2024, the Indian government has been ramping up efforts to support AI startups and reduce reliance on foreign chip imports. It plans to build a large cluster of graphics processing units – a powerful network of high-speed computers – and train AI models, while offering incentives for homegrown chip designs.IndiaAI’s website acts as a portal, offering AI-related resources, networking directories, and event listings.China’s push for semiconductor self-sufficiency started in 2014 with the launch of the$150 billionNational Integrated Circuit Plan. As the US imposed sanctions on China’s high-tech chipmaking in 2018, Beijing scaled up homegrown innovation, making huge investments in tech parks, research and development labs, and startup incentives.India’ssemiconductor policywas created seven years later in 2021.Indian automaker Tata made aforayinto chipmaking by establishing a $11-billion semiconductor fabrication facility in Gujarat in 2024. Several other assembly and testing facilities are coming up, including US chipmaker Micron’s$2.75 billionsemiconductor plant. Tata Group is building a semiconductor assembly and test plant in the northeastern state of Assam, with an investment of nearly $3.3 billion.Manish Tewari, India’s former minister of information and broadcasting, toldRest of Worldthe government wasn’t doing enough to become competitive on a global scale.“The R&D spends are definitely on the lower side. And ultimately, you know, we may be driven by the private sector, but the private sector requires support … especially the kind of support which has been extended by the US, by other countries, including China,” Tewari said.With China becoming increasingly inaccessible for foreign investors amid rising tariffs, industry experts say India’s tech sector mightbenefitfrom the ongoing trade war.In early January, Microsoft announced a$3 billioninvestment for the next two years in India’s cloud and AI infrastructure. Amazon has set aside$120 millionto fund manufacturing and AI development in India.A sense of falling behind in the global AI race was palpable at a recent technology summit co-hosted by global think tank Carnegie India and India’s Ministry of External Affairs, where several panels focused on the country’s AI strategy.Infosys co-founder and chair Nandan Nilekani was among thespeakers. He struck an optimistic note, arguing India is well positioned to enable faster AI adoption, thanks to the digital transformation it has undergone over the past 15 years.Nilekani said DeepSeek’s debut has sped up the trend of models becoming accessible far and wide. The real gamechanger, he said, is how AI is applied and the quality of data behind it.“We should not lose sleep because somebody hasn’t built a model,” Nilekani said. “Anybody can build a model – it’s not a big deal. All the knowledge is out there. It’s the data that makes the difference, so you’ve got to change the focus.”Furquan Ameenis a freelance journalist based in New Delhi, India.This article was originally published inRest of World, which covers technology’s impact outside the West.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.DeepSeekTechnologySemiconductorsChinaIndiaManufacturingRelatedIndia moves up five places to 52nd in the Global Innovation Index for 2019TrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081909/homes-turned-to-rubble-kashmiri-militants-families-question-collective-punishment",
    "title": "Pahalgam: Homes turned to rubble, Kashmiri militants’ families question ‘collective punishment",
    "content": "Kashmir ReportHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’The demolitions carried out after the Pahalgam attack are a first in the history of Kashmir’s 36-year-old insurgency.Safwat ZargarMay 02, 2025 · 06:30 amRead in AppA woman walks through the debris of a home in Murran village, Pulwama. The house belonged to the family of alleged militant Ahsan Ul Haq Sheikh.\n    \n    \n       |\n    \n    Tauseef Mustafa/AFPThe Ganie family is not unfamiliar with security forces knocking on their door at odd hours – especially after their 26-year-old son joined the ranks of Kashmiri militants two years ago.But on the night of April 25, something seemed amiss.“The Army came around 12.30 in the night and asked us to take shelter in the local mosque,” said Aisha Begum, a resident of Mutalhama village in Kulgam district. “Initially, we thought they had come to search the house. But [we realised] that they had already moved our neighbours out of their homes. We were the last to be evacuated.”Around two hours later, they heard a huge blast. When the first light broke on April 26, the Ganie family’s mud-and-brick house was rubble. “What we are wearing is the only thing we could retrieve,” Begum said.Two days before, a group of terrorists had gunned down 25 tourists and a Kashmiri on the Baisaran meadows in south Kashmir’s Anantnag district.The Pahalgam strike was the deadliest attack on tourists in Kashmir’s history. By targeting tourists, security officials in Kashmir toldScroll, “terrorists had crossed a red line”.The attack prompted massive anti-militancy operations across Kashmir Valley along with a crackdown on the families of militants, former overground workers of militant groups and those with a record of involvement in militancy.Begum’s son Zakir Ahmad Ganie, who was a construction labourer before he became a militant, brought his family on the radar. His two elder brothers, uncle and a cousin were detained on the evening of the terror strike in Pahalgam – and his parents’ home razed.Demolishing the house of an accused without any legal procedure violates international and Indian laws. In November, the Supreme Court hadobservedthat razing the homes of individuals for their alleged involvement in crimes amounts to “collective punishment”, which is not permissible under the Constitution.Moreover, Zakir Ganie has not been named as an accused by any security agency in the attack on the Baisaran meadow.While detentions are common after attacks, the demolition of homes of militants’ families is a first in the history of Kashmir’s 36-year-old insurgency.On April 24, two days after the Pahalgam attack, the security forces blasted the home of the family of Lashkar-e-Taiba militant Adil Ahmad Thoker.Thoker has been named by the Jammu and Kashmir police as one of the accused in the Pahalgam attack. The same night, the home belonging to the family of another militant Asif Ahmad Sheikh was demolished at Mongahama village in south Kashmir’s Tral area.Sheikh was not named as an accused in the Pahalgam attack. He had joined the Jaish-e-Muhammad militant group around three years ago.By the morning of April 27, security forces had used explosives to bring down at least nine houses belonging to the families of militants. Two of them are based in Pakistan.The demolitions were spread across four districts of South Kashmir–Anantnag, Pulwama, Kulgam and Shopian – and two districts in North Kashmir.The remains of the Ganie home in Kulgam district.‘How is this justified?’In Mutalhama, there was a sense of resignation mixed with despair. Nevertheless, members of Zakir Ganie’s family questioned the government action. “We didn’t ask him to join militancy,” said Rukaiya Bano, Zakir’s sister. “He just left for work one day and never returned. Had we been supporters of his decision, this was justified. But how justified is it to punish us when we don’t even know if he is alive or dead?”Bano said they are not opposed to the government holding her brother accountable for his acts. “If he’s alive, let them punish him, jail him or kill him,” she said. “But they should also give us justice.”Once a carpet weaver, Ghulam Mohideen Ganie has battled poverty all his life. None of his three sons completed their education and went on to become daily labourers. The family does not own any land.In Kashmir, traditionally, the family inheritance is usually distributed among siblings after they are married or after the death of the parents. Since most militants choose not to marry, their property is shared among their siblings after their deaths.Zakir Ganie’s share would have hardly been a little more than one-fourth of the home that Ghulam Ganie built. Yet, the entire family’s property came in the line of fire.With their home destroyed, the Ganie family now lives in the home of another son that is still under construction. “We cook outside in the open compound and sleep inside,” Bano said. “There are no doors and we use wooden planks at night to prevent dogs from entering.”The family stares at a long struggle to build a new home. “My father had built this house through his daily labour work,” said Rukaiya Bano. “Now, he has to start everything anew.”The distress of families has led the Kashmiri political leadership to urge the Centre to make a distinction between the culprits and their families.“The Government of India must tread with caution and carefully distinguish between terrorists and civilians following the recent Pahalgam attack,” Mehbooba Mufti, former Jammu and Kashmir chief minister and chief of Peoples Democratic Party, tweeted on April 27.She added: “There are reports of thousands being arrested and scores of houses of common Kashmiris being demolished along with those of militants. Appeal Government to direct the authorities to take care that innocent people are not made to feel the brunt as alienation aids terrorists[sic) goals of division and fear.”The ruins of a house belonging to the family of Ahsan Ul Haq Sheikh in Murran, Pulwama.‘A message’Not surprisingly, neither the Jammu and Kashmir Police nor the Army have issued any official statement about their role in the demolitions. However, they have not denied reports of their involvement in the demolitions, either.Scrollspoke to several security officials to understand the seemingly disproportionate reaction against the families of militants.“Foreign terrorists have nothing to lose here. They have come here to die,” explained a senior police official in Kashmir, who declined to be identified. “But it’s very important to understand that foreign terrorists cannot survive without a local support ecosystem.”Therefore, the message has to go out to the local support structure, the officer said.In the past, too, security agencies in Jammu and Kashmir have come down heavily on people who support militant groups.From using the Unlawful Activities Prevention Act to seize properties of those who have sheltered militants, burying dead militants in remote areas to ensure quiet funerals and banning separatist voices, the government has made sure that the cost of supporting militancy has risen enormously in Jammu and Kashmir since its special status under the Constitution was revoked in August 2019.In rare cases, authorities have demolished properties of militants, claiming that they were built on state land.A second police officer in Kashmir toldScrollthat given the scale and unpredictability of the Pahalgam attack, the authorities had to respond in a way that had not been seen earlier. “Tourists have rarely been targeted by militants in the past,” he said. “From the security perspective, our focus remains high on pilgrims because there’s a history of terrorist attacks on them.”He added: “The demolitions cannot be a policy but it conveys the message that this can be the cost of becoming or helping a terrorist. There’s a symbolism to it.”In the opinion of a third police officer, such a drastic measure is going to be a “litmus test” for local recruitment in militancy. “Anyone who imagines himself as a militant now knows what his choice can mean for his family,” the officer said.The blasts at Sheikh's home in Pulwama damaged 16 houses in the neighbourhood, said residents.However, the officer conceded that measures viewed as “collective punishment” could go either way. “It’s a 50-50 situation,” he said. “Either the local militancy will die down or it will come back.”While the demolitions have shocked many, the security forces are also wary of retaliations.According to police officials, militant propaganda in the aftermath of the demolitions has been scathing in its criticism of the Jammu and Kashmir Police.Those who lost their homes to demolitions have alleged that the Army officials who detonated explosives were accompanied by the police.“We are getting inputs about their retaliation but we are ready,” said the third police officer.That threat cannot be taken lightly, given the bloody history of militants targeting off-duty soldiers and police officials in Kashmir. Unlike Army or other paramilitary forces, Jammu and Kashmir Police staffers are deeply entrenched in Kashmiri society. Most of the force is Muslim and from the union territory.In September 2018, Kashmir was rattled by a series of abductions of relatives and family members of police officials in south Kashmir. The abductions had coincided with thearrest of then Hizbul Mujahideen commander Riyaz Naikoo’s father.Many within the police had believed that the abductions were carried out at the behest of Naikoo to pressure the police not to harass the families of militants. The kidnapped were set free by the militants, but the abductions had caused major embarrassment for the security establishment in the valley.However, the third police officer said the current situation is different. “That was a time when we had stone-pelting everywhere,” he said. “The environment was totally against the state, local recruitment was high. That kind of atmosphere is not there now. The recruitment is low and the security forces have an upper hand.”The collateral damageThe demolitions have not just hurt the families of active militants, but in some cases their neighbours too.The damage to other houses was extensive in Murran village of South Kashmir’s Pulwama district.On April 25, security forces brought down the three-storeyed home of the family of active militant Ahsan Ul Haq Sheikh, which is located in a congested neighbourhood. Sheikh has not been accused of involvement in the Pahalgam terror strike.According to the residents and neighbours, one blast was not enough to bring the structure down so, explosives were detonated twice.“The second blast was massive and it damaged at least 16 houses in the neighbourhood,” said an affected houseowner in Murran, who declined to be identified.A police officer in Pulwama said the authorities have assessed the damage to the neighbouring houses and the owners will be compensated.With neighbours also at the receiving end of the “punishment”, the families of active militants were left mortified. “If they had to demolish my house, why didn’t they bring it down by a bulldozer?” asked Aisha Begum in Mutalhama, Kulgam. “We are not able to look into the eyes of our neighbours.”‘They have unleashed a storm’Whenever security forces would raid Mohammad Shafi Dar’s house or village in search of his militant son, he would often repeat a request to them.“I had told the Army and the police that whenever you find my son or whenever he’s trapped in some cordon, inform me and I will walk through the bullets and make him surrender,” said Dar, a farmer in his mid-40s.His 19-year-old son, Adnan Shafi Dar, joined militancy in October last year. Dar remembers the day vividly.“It was October 18,” he said. “the day before he went missing, he complained of back pain and said he would visit Anantnag to see a doctor. The next morning, he left for Anantnag wearing slippers. That was the last time we saw him.”At the time, Adnan Dar was in his first year of college. “Tell me, would any parent deliberately send his child to become a militant – whose end we all know?” asked Dar.Police records allege that Adnan Dar was involved in the killing of a labourer from Bihar in Shopian in October, 2024.On the evening of April 26, Army and police officials moved Dar’s family and neighbours out of their homes in Shopian’s Wandina village. Dar heard the sound of explosives bringing down his two-storeyed concrete house.His wife and four daughters have taken shelter under a makeshift tent put up in the compound of a neighbouring house, which also suffered damage. His second son, Adnan’s brother, has been in police custody since the Pahalgam attack.“They have unleased a storm on me,” Dar rued. “Sometimes, I think, the only option for me is suicide. The forces should have lined up all six of us and shot us dead.”Photographs by Safwat Zargar.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.Pahalgam terror strikeJ&K militancyJ&K homes demolishedRelatedPahalgam attack: Why the buck stops with the Modi governmentTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081859/duty-and-distress-no-easy-solutions-for-mental-health-crisis-in-indias-central-police-forces",
    "title": "Duty and distress: No easy solutions for mental health crisis in India’s central police forces",
    "content": "Working conditionsDuty and distress: No easy solutions for mental health crisis in India’s central police forcesThe home ministry told Parliament that it is improving work conditions for paramilitary soldiers, but the challenge remains enormous.Utkarsh YadavYesterday · 07:30 pmRead in AppParamilitary soldiers in Srinagar in April 2022.\n    \n    \n       |\n    \n    AFPOn February 13, Havildar Sanjay Kumar of the Central Reserve Police Force opened fire on his colleagues at a camp in Lamsang, Manipur, before taking his own life. Aconstable and a sub-inspector were killedand eight others injured.This is only one of several incidents that reflect enormous stress under which members of theCentral Armed Police Forcesare operating. Over the past five years, 730 CAPF personnel have died by suicide – 134 in 2024 alone, according to data presented byUnion Minister of State for Home Affairs Nityanand Raiin Rajya Sabha in December.In the same period, 47,891 personnel opted for voluntary retirement, and 7,664 resigned.The CAPF, which is administered by the home ministry, comprises the Border Security Force, Central Industrial Security Force, Central Reserve Police Force, Indo Tibetan Border Police, Sashastra Seema Bal and the Assam Riles.In response to a question on whether attrition and poor performance were the result of long working hours, Rai wrote, “Measures have been taken to implement a transparent, rational and fair leave policy and to regulate duty hours to ensure adequate rest and leave,” wrote Rai.The minister listed14 measuresthat had been taken to improve working conditions. Transparent leave and transfer policies were at the top of the list with other initiatives such as peace postings, regular promotions and financial benefits.These concerns and measures have also been outlined by a task force constituted by the Ministry of Home Affairs in 2021 to study suicides and fratricides among the CAPF.In itsfinal report to the home ministryin January 2024, the task force had highlighted service and working conditions, and personal challenges, especially related to getting leave, as the major causes of suicide and fratricide.Among working conditions, the task force pointed out career stagnation, inadequate rest and an institutional culture that discourages personnel from seeking help as significant factors.The task force had recommended the mental health screening of soldiers returning from leave or long-term duties, according toThe Indian Expressreport.The minister’s response to Parliament shows that though the government has taken the issue seriously and is working to address it, the challenge remains significant.A long-pending issueConcerns about the mental health of CAPF soldiers and their working conditions have been well established over the years.For instance, a 2019 discussion paper had pointed out that CAPF personnel are deployedin hostile regions, under tremendous pressure and without adequate leave or rest. These deployments do not alternate with peace postings, said the report, though, as Rai told Parliament, the home ministry is making efforts to change this.This could also help address a problem pointed out by the task force: that 80% of CAPF suicides occurred after personnel returned from leave, often due to unresolved family orfinancial issues.Career stagnation is also a concern, points outRC Sharma, a retired commandant of the Border Security Force. In an article inForcemagazine in 2020, Sharma wrote that soldiers remain at the rank of constable for 20 years though they are supposed to be promoted within eight years to head constable.Soldiers and officials at other ranks similarly spend years, even decades waiting for promotions, Sharma noted.On the other hand, Indian Police Service officials can join the Central Reserve Police Force directly as anAssistant Commandant and rise to the top ranks.An acute shortage of personnel aggravates these pressures. As per official data, the Central Armed Police Forces function with a huge shortfall –1.11 lakh vacant posts, according to data shared by the home ministry to the Parliamentary Standing Committee on Home Affairs, said theDeccan Herald. This translates into increased work for those onactive duty.Other major factors that thetask force highlightedwere bullying, trauma of abuse and discrimination.Soldiers hesitate to seek help, fearing that it will affect their promotions or label them as “unfit for duty”. An officer of the Central Reserve Police Force toldThe Printin 2023 that counsellors had been roped in, in line with the recommendations of the home ministry task force that examined mental health concerns among the force.But as the task force noted, “mental health-related issues are still ‘taboos’in the security forces”, reportedThe Indian Express. “The personnel hesitate to share their problems because of the fear of being mocked and taunted as weak by other colleagues.”Will reforms work?Some CAPF initiatives have shown promise. For instance, the Central Industrial Security Force in 2021 introduced theMental Health Championship Programme and Project Mannfocusing on peer-led counseling and early intervention. Similarly, theIndian Armyin 2023 issued guidelines and launched a pilot programme to address the mental health of soldiers and their families.They offer useful models to be expanded across the CAPF.A starting point could be mandatory, confidential psychological checkups to ensure personnel receive timely support without fear of stigma. The task force had pointed out thatstress management effortswere “haphazard, sporadic and generally not carried to their logical conclusions”.A robust suicide prevention framework should be implemented, focusing on early identification of at-risk personnel through behavioral assessments and peer support mechanisms.Utkarsh Yadav is a law student at Dr Ram Manohar Lohiya National Law University Lucknow.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.Nityanand RaiCentral Reserve Police ForceMinistry of Home AffairsMental HealthRelatedIndia’s rural employment scheme can build climate resilience – but only if it is fully utilisedTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081957/ramachandra-guha-in-wake-of-pahalgam-recalling-nehrus-advice-on-resisting-pakistans-provocations",
    "title": "Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocations",
    "content": "OpinionRamachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsNehru insisted that India must give its Muslim community ‘security and the rights of citizens in a democratic state’.Ramachandra Guha5 hours agoRead in AppA boatman on Dal Lake in Srinagar protests against the Pahalgam terror attack.\n    \n    \n       |\n    \n    AFPSurely the most noble of human emotions is to find hope in the midst of tragedy. One of the tourists killed by the terrorists in Pahalgam was N Ramachandran from Kerala. On her return home, his daughter, Arathy Sarath, spoke movingly of the succour she found from two young men in the wake of her suffering.The Hindunewspaper quoted Sarath as saying: “Musafir and another local driver Sameer were with me all through, including when I stood outside the morgue till 3 am. They treated me like a younger sister. Kashmir has now given me two brothers.”As reports in other papers confirm, Musafir and Sameer were entirely representative of how Kashmir, as a whole, reacted to the barbarism that claimed so many innocent lives. Several tourists who were at the scene of the attack were shepherded to safety by their Kashmiri guides.At least one of these guides, like the others a Muslim by faith, was killed by the terrorists. As tourists sought to flee in panic, clerics opened mosques to provide beds for those who did not have hotel bookings. Taxi drivers refused to charge fares for passengers seeking to get to Srinagar airport.The day after the killings, there was a complete hartal in Kashmir as shops, hotels, schools, colleges all stayed closed to express their sympathy with the victims of the violence. All political parties, whether in power or in the Opposition, took out rallies in condemnation of the terrorists and their backers from across the border.“Musafir and a local driver Sameer were with me all through, even outside the morgue, till 3 a.m... Kashmir has now given me two brothers,\" says Arathy Sarath, who lost her father in#Pahalgam.“Let Allah keep you safe,” was her parting words to them.https://t.co/HBsmMipw6a— Meera Srinivasan (@Meerasrini)April 25, 2025To this historian, the aftermath of the attack recalled the similarly exemplary behaviour of Kashmiris in the wake of the first-ever attack launched by Pakistan on the Valley, in the immediate aftermath of Independence and Partition. Then, in the late autumn of 1947, amidst the savage bloodletting elsewhere, especially in East and West Punjab, Kashmir was a haven of communal harmony as Muslims, Hindus and Sikhs all stood together in solidarity against the invaders.There is little question that, by the targeted killings of Hindus, the terrorists hoped to polarise Hindus against Muslims across India. They failed in this aim, at least as far as Kashmir is concerned. Now it is for the rest of us, who live in the other states and Union territories of our country, to similarly rise to the occasion.The signs so far are unpromising. In Rajasthan, a Bharatiya Janata Party MLA entered a mosque during Friday prayers, shouting “Jai Shri Ram” and placing a “Pakistan Murdabad” sign on the premises. In Assam, the Bharatiya Janata Party chief minister initiated arrests of political rivals whom his administration claimed were “anti-India” and made similar charges on social media as well.In Madhya Pradesh, a Congress MLA, who happens to be Muslim by faith, was issued death threats. In Gujarat, police rounded up people they claimed were “infiltrators”; among them were several hundred bona fide Indian citizens.In Uttar Pradesh, Uttarakhand and Punjab, Kashmiri students have been forced by right-wing goons to leave their hostels, put on hold their education, and return to the Valley. In Mussoorie, Kashmiri shawl-sellers had to abandon their trade and go back home.Meanwhile, in Kashmir itself, where with its present Union territory status it is the Union government that controls law and order, there has been a wave of arrests and bulldozing of houses in which some or even many Kashmiris altogether innocent of any links to terror are likely to have suffered.#Updateon Crackdown against traitors for defending Pakistan on Indian soil- 22.30hrs | 02 May1️⃣Amar Ali arrested by@Dhubri_PoliceA total of 37 Anti Nationals put behind bars till now.All these anti-nationals will be dealt with firmly by@assampolicepic.twitter.com/xlbEMq7RjJ— Himanta Biswa Sarma (@himantabiswa)May 2, 2025It was also disappointing to see that the prime minister’s first public speech after the tragedy was made in Bihar. That this state is scheduled to have assembly elections in a few months is unlikely to have been a coincidence. In that speech, and later in aMann ki Baataddress, Modi referred to Indians being united in their condemnation of terror regardless of the language they spoke. A more statesmanlike approach would have been to acknowledge and appreciate the pluralism of religion that distin­guishes our country as well.This omi­ssion was particularly distressing in light of the admirable conduct of the Kashmiris on the spot, of which the prime minister was surely not unaware. Finally, Modi’s decision to skip the all-party meeting held to discuss the terror attack displayed a dismaying lack of respect for democratic procedure.The prime minister’s pluralism is selective – it embraces language but not religion. (Other BJP leaders are even more narrow-minded; for them, Hindi is the supreme language of India just as Hinduism is its superior religion.) It was thus refreshing to see that the defence minister, Rajnath Singh, did squarely state that, in the wake of the barbaric attack in Pahalgam, all Indians stood unitedirrespective of religion.In a departure from his speech style,in a clear message for global audience, PM Modi speaks in English too in Bihar rally. 1st reaction on#PahalgamTerroristAttack.‘India will identify, pursue the attackers, terrorists and their handlers.They will be punished strongly’@PMOIndiapic.twitter.com/mDluPetiZl— Smita Sharma (@Smita_Sharma)April 24, 2025As with previous terror attacks orchestrated from across the border, this one too poses two distinct sets of tests: one for the Indian state and a second for the Indian people. Unlike newspaper columnists and television anchors based in New Delhi, so ready to offer advice on how and when to go to war, I do not believe I have any views of any originality or worth in this matter. How the Indian state should respond, what precise mix of diplomatic, economic and military measures it should adopt to, as it were, “punish” the Pakistani state for its tacit and overt support for terrorism, is beyond my domain expertise.However, as a defender of the constitutional values of democracy and pluralism, I do have views on how my fellow citizens should respond.These broadly coincide with the views of India’s first prime minister, Jawaharlal Nehru. On October 15, 1947 – exactly two months after Partition – Nehru wrote this to the chief ministers of states: “We have a Muslim minority who are so large in numbers that they cannot, even if they want to, go anywhere else. They have got to live in India… Whatever the provocation from Pakistan and whatever the indignities and horrors inflicted on non-Muslims there, we have got to deal with this minority in a civilised manner. We must give them security and the rights of citizens in a democratic State.”Nehru is a much misunderstood, much vilified, figure in India nowadays. Some of this retrospective criticism is merited; for example, as prime minister, Nehru should have begun to release the state’s stranglehold over the economy by the late 1950s (by which time it had clearly proven counters-productive)‚ and he should not have been so naively trusting about China. On the other hand, we Indians now need his robust, uncompromising defence of religious and linguistic pluralism more than ever more.Nehru’s enduring relevance in this regard is best illustrated by quoting some remarks made in recent weeks by the chief of the Pakistani army, General Asim Munir. Days before the terror outrage, this man had insisted that Kashmir was the “jugular vein” of Pakistan.A few days after the butchering of Indian tourists, he told the graduating cadets of the Pakistan Military Academy that “the two-nation theory was based on the fundamental belief that Muslims and Hindus are two separate nations, not one.” He further insisted: “Muslims are distinct from Hindus in all aspects of life – religion, customs, traditions, thinking, and aspirations.”As is by now well-known, the ideologues of the Hindu Right, such as VD Savarkar, mimicked this sort of thinking entirely. They articulated their own version of the two-nation theory. They too thought Hindus and Muslims separate and distinct in their ways of thinking and being, they too claimed that Hindus and Muslims could not companionably, peaceably and equitably live together in the same political or territorial unit.Transferred to the situation today, when so many Muslims do in fact live in post-Partition India, the Hindutva ideology insists that they can only do so by subordinating themselves economically, politically, and culturally to the Hindus.Against this pernicious, polarising way of thinking, Jawaharlal Nehru stood steadfast. When, in the first few months after Partition, the Pakistan state was determined to inflict indignities and horrors against its non-Muslim citizens, Nehru insisted that his government in India would deal with its Muslim minority “in a civilised manner” and “give them security and the rights of citizens in a democratic state”.Now, as terrorists aided by Pakistan have so brazenly murdered tourists in Kashmir who happen to be both Indian and Hindu, we who care for the future of this Republic, we who cherish and uphold its founding values, must redouble our efforts to treat with dignity and respect, and to consider as full and equal citizens, those Indians who happen to be Muslims by faith.This article first appeared onThe Telegraph.Ramachandra Guha’s latest book, Speaking with Nature: The Origins of Indian Environmentalism, is now in stores. His email address isramachandraguha@yahoo.in.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.Pahalgam terror attackPakistanVD SavarkarRelatedRamachandra Guha: Ignored by the ‘national’ media, a disaster is unfolding in Great NicobarTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081869/indias-complex-history-cannot-be-wished-away-through-textbook-revisions-it-must-be-confronted",
    "title": "Omissions and revisions reflect the real battle beyond the pages of history textbooks",
    "content": "Battle for historyIndia’s complex history cannot be wished away through textbook revisions – it must be confrontedEducation must empower students to question, investigate, and understand the past – not as a monologue, but as a conversation among diverse voices.Hasnain NaqviYesterday · 06:30 amRead in AppAn idealised portrait of Mughal Emperor Babur, c1605-10.  \n    \n    \n       |in public domain, via Wikimedia CommonsWhen the National Council of Educational Research and Training rolled out major revisions to the Class 7 Social Science textbooks last month, it sparked a debate about historical accuracy and ideological intent.Key historical chapters on the Delhi Sultanate and the Mughal empire were eliminated from the textbooks that are used by schools affiliated to the Central Board of Secondary Education.At the same time, new material was included highlighting ancient Indian dynasties and Hindu pilgrimage sites, including the recently concluded Maha Kumbh.The revised content emphasises some aspects of India’s ancient heritage – focusing on dynasties such as the Mauryas, Shungas, and Sātavāhanas – while virtually erasing centuries of Muslim rule.False binaryAt the heart of the controversy lies a fundamental question: should education prioritise verifiable history or cultural memory? While epics such as the Ramayana and Mahabharata play a crucial role in shaping India’s civilisational identity, historians warn against equating mythology with history.The former embodies symbolic truths and values, while the latter relies on documented evidence and critical inquiry.The new chapters devote considerable space to sacred geography such as the 12 jyotirlingas or representations of Shiva and the four Himalayan pilgrimage sites of the Char Dham. But they do not adequately distinguish between devotional tradition and historical fact.Critics argue that such an approach undermines the core objective of history education: to foster critical thinking and an evidence-based understanding of the past.The Allahabad Fort, constructed by Mughal Emperor Akbar, on the banks of the Yamuna where it meets the Ganga, in this illustration by Robert Montgomery Martin, c1860. Credit: in public domain, via Wikimedia Commons.Ideological shiftsThese changes are part of a larger pattern of curriculum revisions influenced by the dominant political ideology. Under various governments, education has frequently become a battlefield for contesting narratives.NCERT revisions in 2023 had already removed chapters on the Mughals in Class 12, along with material about Dalit writer Omprakash Valmiki and the theory of evolution in Class 10.These deletions were heavily criticised by historians as attempts at erasure, particularly of the contributions of Muslims and minority groups to Indian history.Dissent and supportReactions to the recent changes are deeply polarised. Scholars such as Audrey Truschke assert that erasing the Mughals from textbooks does not erase them from history, but it does deny students a fuller understanding of India’s pluralistic past.Others, such as academician Apoorvanand, warn that the revisions portray Indian history as exclusively Hindu, sidelining centuries of Islamic and syncretic influences in the subcontinent.Meanwhile, supporters of the move – particularly from the ruling Bharatiya Janata Party – defend the changes as a necessary corrective to what they see as a colonial and Marxist legacy in Indian historiography. By spotlighting ancient Indian knowledge systems and spiritual traditions, they argue, the new curriculum fosters national pride and cultural self-awareness.NCERT Director Dinesh Prasad Saklani rationalised the omission of sensitive material, such as about communal riots, on the grounds that such topics could damage the mindset of young learners. However, this approach has been criticised as an attempt to sanitise history and suppress uncomfortable truths.Selective memoryOne of the most glaring examples of selective representation is the inclusion of the recent Maha Kumbh Mela in the new curriculum. The event is described in glowing terms, with references to the participation of over 660 million pilgrims, emphasising its cultural magnitude. Yet, conspicuously absent is any mention of the stampede in Prayagraj, which resulted in several deaths and injuries.This selective omission has raised red flags among educators and historians, who see it as a deliberate move to present an idealised and conflict-free narrative.Such portrayals, they argue, strip historical events of their complexity and hamper students from understanding the socio-political challenges that accompany large-scale religious gatherings in modern India.Devotees at Triveni Sangam in Prayagraj in November 2024. Credit: Scroll Staff.Rewriting or reclaiming?The deeper issue here is the evolving definition of history itself. Is history simply a chronicle of rulers and battles, or does it also encompass the social, cultural, and political experiences of all communities? By removing entire chapters on the Mughals and the Delhi Sultanate, the new textbooks not only marginalise a significant part of India’s past but also risk presenting a monolithic version of history that aligns with a specific ideological worldview.At the same time, incorporating India’s spiritual and cultural traditions into education is not inherently problematic – provided there is clarity about what constitutes history and what belongs to the realm of belief. The problem arises when myth is repackaged as fact and when cultural pride is used to justify historical distortion.Identity politicsThe textbook revisions reflect a broader ideological battle playing out in Indian society: the struggle between inclusive, secular education and ethnocentric nationalism. This is not merely an academic concern but one with serious implications for how future generations perceive themselves, their country and their place in the world.Critics have gone so far as to call this process a form of “cultural genocide”, suggesting that erasing Muslim contributions from textbooks is part of a larger project to redefine Indian identity along religious lines. Historian S Irfan Habib has described the revisions as “Hindu nationalist propaganda”, while Harbans Mukhia sees them as attempts to unify the Hindu vote through cultural consolidation.Balanced curriculumThe need of the hour is not to eliminate religious or cultural references from textbooks but to present them in a nuanced and balanced manner. The Mughal Empire, for instance, should be taught not just as a political period but also in terms of its artistic, architectural, and cultural contributions.Similarly, events like the Maha Kumbh can be included with full transparency, acknowledging both their spiritual significance and logistical challenges.A robust history curriculum should encourage students to think critically, engage with multiple perspectives and understand the past in all its complexity. By doing so, education can become a bridge between tradition and reason, rather than a tool for ideological conformity.The textbook changes are not just about what students learn – they are about how India defines itself as a nation. Education must empower students with the ability to question, investigate, and understand the past – not as a monologue, but as a conversation among diverse voices.In the end, history cannot be wished away. It must be confronted, understood and taught honestly. Only then can we prepare a generation that will be capable of building a future that honors the richness – and the contradictions – of India’s complex heritage.Hasnain Naqvi is a former member of the history faculty at St Xavier’s College, Mumbai.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.NCERTHistoryMughal EmpireIndian HistoryKumbh MelaDelhi SultanateHindutvaRelatedMaharashtra CM orders police to get ‘objectionable’ content about Sambhaji removed from WikipediaTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1080972/hot-water-bhavika-govils-debut-novel-movingly-constructs-a-childs-fragile-yet-resilient-world",
    "title": "‘Hot Water’: Bhavika Govil’s debut novel movingly constructs a child’s fragile yet resilient world",
    "content": "Book review‘Hot Water’: Bhavika Govil’s debut novel movingly constructs a child’s fragile yet resilient worldThe novel is sensitive to how quickly the tides of puberty and adolescence change a child, and how fiercely they try to hold on to the remnants of innocence.Sayari DebnathYesterday · 08:30 amRead in AppAuthor Bhavika Govil.\n    \n    \n       |\n    \n    Athul PrasadI was introduced to Bhavika Govil’s fiction in 2022 through the short story “Eggs Keep Falling from the Fourth Floor” inA Case of Indian Marvels: Dazzling Stories from the Country’s Finest New Writers(published by Aleph Book Company). Back then, I had called it a “marvellous portraitof a deeply disturbed brain that forces the reader to confront the stigmas attached to mental health in our society.” It indeed was. I was thoroughly impressed by what I had read and Govil’s sensitive treatment of her protagonist, who is of unsound mind and often misunderstood.A year later, I met Govil at the Jaipur Literature Festival, where at a party, she told me about her debut novel. Her manuscript had been accepted by the publisher and she already had a title for the book:Hot Water. It would be out in two years, and Govil was already excited about it. I promised to read…and write about it.I’m glad I kept my promise.A world of threeThere are moments inHot Waterwhen the air feels too stuffy to breathe. Your skin feels sticky, and the saltiness of sweat fills your mouth. It feels like a painful, oppressive summer – not good news to those of us who live in India. Govil tackles this kind of summer in her novel. The children, Mira and Ashu, jump in and out of a swimming pool for coolness and play, but there is little relief. The coach and Ma seem suspiciously playful with each other and the underwater games that the siblings have devised are at a great risk of backfiring any day. And one day it sure does, and pool adventures come to an end.Small and compact, in this world of three, women outnumber men. Ashu suspects his mother is more affectionate towards his sister than she towards him. For eight-year-old Mira, her world revolves around her 14-year-old brother. He’s going through “Pew Burty” and is mean to her sometimes, but she knows he loves her – she has never once doubted it. Ma works at the admin department at an office. She doesn’t have much of a social life and seems to be estranged from most of her family. Her closest friend and confidante is her colleague Mrs Shome, in whose care the children find themselves when Ma disappears for a few hours every now and then.Ma doesn’t usually behave like a typical mother. Mira thinks of her as a friend, Ashu observes how she’s not much of a disciplinarian. The children sometimes tire of her eccentric ways. However, she keeps them clothed, fed, and alive – and that counts for something.It is at the very beginning that the author suggests something isoffbetween the mother and son. He’s like a demon baby, too heavy to be lifted by a mother’s able arms. She can’t seem to generate enough strength for him; he almost feels like athingthat’s draining her of health. The difficult labour with him, as opposed to the “buttery smooth” exit of the daughter, will result in lifelong grudges and hostility that started much before the son entered the world.Meanwhile, growing up without a father is a free ticket to being ostracised at school. The oddness of their family is fully comprehensible to their schoolmates. There’s rumours of Ma being a “whore”, or at least some sort of nutjob. Ashu saves himself from being picked on by befriending Rahul, the popular boy in class. Mira is not so lucky – if anything, her friendless status makes things all the more difficult as she’s left all alone to prove that her mother is normal like everyone else’s.The world of three experiences an intense change when Avni, their aunt’s daughter, comes to stay with them during the summer vacation. Newly dazzled by the workings of a woman’s body (and mind), she wreaks emotional havoc by inciting Ashu to give in to the callings of his hormone-addled brain and preparing Mira for what’s to come. She has a secret boyfriend – Mira equally disbelieves and is intrigued by this claim. A game of truth and dare sets off a chain of events in Ashu’s life that culminate in a painful coming-of-age. Mira, who has thus far been loved and protected by the women around her, will realise that the world outside is dangerous and not to be trusted.The many voicesGovil chooses first-person narrative voices for Mira and Ma, and third-person for Ashu. Among the three, Mira is the newest to living – her childish curiosity and humour infuse their lives, and diffuse unpleasant situations. This is the strongest voice in the novel. It is so alive and energetic that it is almost as though Mira is babbling into your ears. The child isn’t very wise, but she’s perceptive and much of her preoccupation has to do with soothing Ashu and Ma’s moods. There is a sweet earnestness in trying to take care of those around her. It’s the greatest marker of innocence – to believe that one has the power to make things better.Ashu’s third-person voice signals the dissociation that the boy feels from his younger self as he metamorphoses into a man. He is not oblivious to his mother’s contempt for him but it is the fallout with his best friend that turns out to be the harshest blow. Ashu’s narrative lacks the boisterousness of Mira’s, but it is so tender that the reader’s heart aches for the young boy as he makes sense of his emotions and changing body all by himself.And yet, the novel is weakest in its treatment of Ma. The first-person voice, though the most natural choice, doesn’tdomuch. Her secrets hover like dark clouds over the family, and when they part, do not reveal anything substantial. A revelation need not always be shocking, but it needs to be convincing. A careful reader will see it coming from a distance. While some details are unexpected, they also feel a bit contrived. Some of her decisions provoke questions in the reader’s mind, but they aren’t answered satisfactorily.Govil’s strengths lie in world-building and empathising with children. She has a remarkable ability to map their emotions – you instantly feel protective of Ashu and Mira. She is sensitive to how quickly the tides of puberty and adolescence change a child, and how fiercely they try to hold on to the remnants of innocence. Mira’s voice reminded me of nine-year-old Swiv in Miriam Toew’s remarkable novelFight Night. I was tempted to imagine their conversation were they to bump into each other!The final chapter is especially moving and I had a lump in my throat when I read the final lines. I selfishly wanted the entire novel to be in Mira’s voice. But I did not want to miss out on Ashu’s, though I didn’t care much for Ma. The child’s universe is as resilient as it is fragile, as beautiful as it is rickety – andHot Watergets that right.My introduction to Govil was through the short story medium; she has an indisputable talent for it – is there a collection of short stories in the making? I do hope so.Hot Water, Bhavika Govil, 4th Estate/HarperCollins India.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.book reviewdebutfictionRelated‘The Tiger’s Share’: In Keshava Guha’s second novel, a family man does the unthinkableTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081661/may-fiction-six-new-novels-and-short-story-collections-to-cool-down-with-in-summer",
    "title": "May fiction: Six new novels and short story collections to cool down with in summer",
    "content": "Read To WinMay fiction: Six new novels and short story collections to cool down with in summerThree debuts, a novel about lost languages, short stories about the immigrant experience, and more.Scroll Staff3 hours agoRead in AppAll information sourced from publishers.Songs Our Bodies Sing, Lindsay PereiraA heartbroken father in London turns to the Beatles to make sense of what he has lost. An antique dealer in Bombay rejects jingoism in favour of racism. Two immigrants in Toronto look for ways of belonging with a local rock band. And, in Paris, a tourist rejects long-held ideas about trust.The East and West have clashed in innumerable ways since each first acknowledged the existence of the other. The stories ofSongs Our Bodies Singare set at these points of intersection. What they reveal are commonalities rather than differences, with protagonists on opposite sides of an imaginary divide, trapped in boxes of their own making.My Name is Jasmine, Shashi WarrierA woman wakes up confused in Malkangiri District Hospital in Odisha. When a nurse wants to know her name, she blacks out in terror at the realisation that she has no idea who she is.The next time she wakes up, the terror returns, but she wills herself to look at her world more rationally. She discovers she’s suffered a head injury and lost some of her memories in the aftermath. When the police come, she finds out that she knows more about guns and violence than any common citizen should. Floating voices in her head tell her: trust no one, keep to yourself, you’ve been through worse and survived.When a psychiatrist is brought in to find out whether she’s faking her amnesia, she's inclined to trust him.Her fingerprints lead the police to believe that she is part of a group that’s planning a major operation soon. While the investigating agency fears that her former colleagues might try to have her killed before she can testify.Deciding that she needs legal help, the psychiatrist calls in a former Supreme Court advocate. Given the concern and support from the psychiatrist and the lawyer, Jasmine is torn: should she give up her group that supported her when she had nowhere else to go? Or these two people, who believe in her when no one else would?Age of Mondays, Lopa GhoshTen-year-old Narois wakes up to find that her mother is preparing to go to a mysterious place – a place neither too far nor too close. It is a motherless Monday. The first of many.As Narois’s father struggles to adapt, as her parents' marriage comes apart, as Narois herself tries to make sense of the goings-on – is her mother having an affair; is she planning to abandon the family forever? – she creeps away into the dark, magical-real Jahanpanah forest to escape. Here, she encounters the Jugnus – legendary healers and weather-workers. Silver Samir, their handsome leader, Mian Pagla, who followed the river, Kochi who is bendy when sad, and Velu the gentle murderer mesmerise Narois with their tales; she will do what she can to belong to them.It is a world on the brink, where the mother Narois leans on may be unable to protect her and where betrayal can be love in disguise.One More Story About Climbing a Hill, Devabrata DasIn “A Night with Arpita”, a beautiful young girl in a train compartment captures the imagination of the writer – but he is unable to fathom the reason for her melancholy until it is too late. In “Ananta with His Seema”, three apparently disconnected incidents take place on a railway platform. Descriptions of the incidents are interspersed with passages from a letter written by Ananta’s friend, which lays bare his helplessness in the face of injustice and the loss of his youthful ideals.In the eponymous story, life imitates art with a disastrous twist. A young couple treks up a hillside to recreate for themselves the experience of two characters in a love story set in idyllic Shillong. But the beauty of the pine shrouded hills is marred by extremist violence and their climb to the top of the hill has an unforeseen, macabre end.Each of the eighteen stories in this collection provides an insight into life in an area of conflict, told with irony and ingenuity.The Dead Know Nothing, Kishore RamDisgraced after failing the seminary exams, Thankachan has returned to his old life. On Fathima Island in the Ashtamudi archipelago, his days are clouded over by the fear of never making anything of himself, but soon, strange events begin to happen on the island. A dead body surfaces one day, then another. Soon, a murder case considered solved years ago is suddenly once again wide open. Is his evasive brother involved in something sinister? Is the fate of a fisherman’s son really sealed at birth?Packed with intrigue, compelling characters draw the reader into their lives and the heart of the dark secrets that have long lain dormant. Once revealed, they threaten to shake the foundations of community life and wreck Thankachan’s hopes for the future.Water Days, Sundar SarukkaiAt the cusp of the millennium, in a fast-changing neighbourhood in Bangalore, Kannada, Malayalam, Tamil, Telugu and Hindi form a buzzing background of muted conversations as speculation mounts about what really happened that night when a girl barely out of her teens died. Raghavendra, erstwhile security guard dreaming of setting up his own grocery store, finds himself unexpectedly in the middle of it all, tasked with the responsibility of finding out the truth by his wife Poornima. And every morning, for the thirteen days that it takes for the soul to find liberation and the story its resolution, the women gather at the water taps before sunrise, collecting water and stories …Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.reading listfictionRelatedApril fiction: Six newly published novels and short story collections about contemporary Indian lifeTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081804/women-need-their-own-rooms-in-their-own-worlds-deepa-bhasthi-on-translating-the-female-language",
    "title": "‘Women need their own rooms in their own worlds’: Deepa Bhasthi on translating the female language",
    "content": "Found in translation‘Women need their own rooms in their own worlds’: Deepa Bhasthi on translating the female languageThe International Booker Prize-shortlisted translator reflects on translating Kannada writers Kodagina Gouramma and Banu Mushtaq.Deepa Bhasthi4 hours agoRead in AppTranslator Deepa Bhasthi.An editor, a bookseller and a writer walked into a Mediterranean restaurant – one that also served biriyani, most curiously – the other day. Over plates of lamb-something, semi-delicious hummus, some pita and fried halloumi, the serving washed down with olive lemonade, they talked about books, writing, female experiences plus gaze and such other essentials.By the end of the long evening in sultry, humid Bangalore, I wondered what an eavesdropper – not that there were any, I must add – might have made of a table of women dipping in and out of this and that topic. Us women fascinate me in a way that a roomful of men, even if, or perhaps especially if they are discussing the state of affairs of home, country or world could never. It isn’t that women don’t care for or talk about grander affairs around us. (Although, really, what could be more historically fraught, regularly violent, unhinged, even, and deeply political than one’s family?) But the idea that we do it in a language that is gendered is one of my great current interests.It is also what fuels a deepening interest in translating the feminine, whether it shows up as stories foregrounding the female experience in my own writing practice or in translating works by women writers.Linguists have long toyed with the idea that a woman’s language is a different language, that there are subtle and not-so-subtle differences in tone, grammar, intonations, in phrasing, even in pronunciation and several other parts that make up a language. But research to objectively prove the gendered nature of language is often riddled with the inability to arrive at the same results consistently across time and place, and is supported mostly only by anecdotal material. Yet, any woman speaking any language anywhere in the world will be privy to, and admit to using gestures, movements, instincts, words and other linguistic tools that are designed to keep her communication outside of male attention and understanding.Keep the scientists aside; I don’t think anyone thinks as deeply about how language/s and sociolinguistics work in defining worlds as much as translators do. It is an odd feeling, to think simultaneously in two (or more) languages, playing with the grammar, syntax and unique idiosyncrasies of two distinct language cultures: Kannada, my mother tongue, and English, in my case. It is not until very recently that I began to consciously think about what it means to train language to work for and use it from a female gaze. Perhaps it is that such exercises make up so much of our interiority that we don’t see it as another thing to insert into the multiple listicles going on in our overworked minds.The female language manifests like a quiet tremor throughout two of the three books I’ve published in translation: Kodagina Gouramma’sFate’s Game and Other Storiesand Banu Mushtaq’sHeart Lamp: Selected Stories, which is currently shortlisted for the International Booker Prize 2025. Both are set in the interior worlds of women, although the stories couldn’t be more different from one another in terms of the social and religious identities of the writers, the community the women they wrote live in, even the time periods. Where Gouramma worked in the 1930s and died at just 27 when she was starting to build a writing career, Mushtaq’s stories are deeply informed by her decades of work in social movements and her career as a lawyer. The stories inHeart Lampare selections from work published between 1990 and 2023.Yet, one realises that all the women in each of these stories could, with minor changes, obviously, shift into the other’s world and still, to the reader, make absolute sense. This is, in fact, a damning treatise on how little the women’s position in a patriarchal society has changed, that even though they are over half a century apart, attempts to control and tame the female continue, just as women’s resistance and dissent and rage against these methods carry on as well.In “Vani’s Puzzle”, perhaps the best known of Gouramma’s short stories, there is a strong female friendship between Indu, a young widow and Vani, a neighbour she befriends and the wife of the busy doctor she develops a crush on. The two women are often doing things together, keeping house, cooking, ironing the man’s shirts – one sees everything as annoying chores, the other, Indu, is house-proud, happy to potter about. Gestures, but mostly instinct, guide the way they adjust their friendship around the routine of the man. When two women, as close as they can be, speak, a lot is said, although not necessarily in words.Likewise, in Mushtaq’s stories, what remains unsaid is often more than the thoughts, dialogues and instinctual reactions that make it to words on the page. Food – the making of, usually – features prominently in many of the stories inHeart Lamp, it is when women do their thinking, analysing, berating (usually men). Biriyani, parottas “as light as flowers,” watermelon, fried fish from the Kaka’s Hotel, a glass of milk from an old kitchen with a dirty, worn-out floor, chicken soup and the grand generosity of a packet of cheap biscuits bestowed on a poor person – these set the stories within the architecture of female-hood.There is, however, little actual architecture in either Gouramma’s or Mushtaq’s stories, nothing much to orient the reader spatially, save for in a story here or a setting there. Perhaps this too is intentional, subconscious. For a woman rarely has ownership over her surroundings. In patriarchy, she first lives in her father’s house, then her husband’s, and if a lifetime of self-sacrifice brings her luck, ends her life at her son’s. What she owns is emotional weight, access to a life-giving sisterhood and her own interior landscape, none worth all that much, if patriarchy had its way.As a translator, relaying these layers of the unspoken and the felt is immensely gratifying. It feels like love to convey just how complex, how nuanced, how exquisite a woman’s world is. Yet, it feels also like a betrayal, as if videotaping a secret handshake for the whole world to see.Will men, even some women, understand better now? Do we want them to? What I do know is that us women, with our sense of humour, our resilience, our everyday dissent and the undeniable truth that we mostlygeteach other, these change living, breathing things like language all the time. When one has another language, one has another way to be in the world. Goodness knows that women need their own rooms in their own worlds. And perhaps that is the moral of the story.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.kannadatranslationwomenlanguageRelatedHaruki Murakami and the challenge of translating Japanese’s many words for ‘I’TrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081773/thriller-every-student-in-an-elite-noida-school-is-a-suspect-when-a-schoolmate-is-killed",
    "title": "Thriller: Every student in an elite Noida school is a suspect when a schoolmate is killed",
    "content": "BOOK EXCERPTThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedAn excerpt from ‘No Time to Blink’, by Novoneel Chakraborty.Novoneel ChakrabortyMay 02, 2025 · 05:30 pmRead in AppAuthor Novoneel Chakraborty.\n    \n    \n       |via InstagramKisha stood outside the chemistry lab, waiting for Vedan to come out when she noticed Demi – one of Anara’s batchmates – staring at her. When their eyes met, Demi came out before the rest of the class.“I just wanted to say I’m sorry about Anara. I couldn’t have imagined that someone would kill her.”Kisha was taken aback at Demi’s words. But she kept calm, her true feelings carefully locked away in an emotional fortress.“If you need any help, just let me know, okay?”“I will, thank you,” Kisha replied as the bell rang. As the students shuffled out of the lab, she noticed Vedan leaving the room. She made her way through the crowd, jogging behind Vedan.“Can we please talk?” Kisha asked, as she caught up with him.Vedan stopped and looked at Kisha quizzically, as if he wasn’t used to a girl stopping him to have a conversation. There was nothing that stood out about Vedan’s appearance. He was average, in every sense, and he knew it.“Aren’t you Kisha Sen?” he asked.“I am.’“I’ve seen your lecture,” Vedan said, referring to the viral video of her lecture at the United Nations.“Glad. By the way, can we please talk in the cafe?”Vedan gave her a long look and said, “I see there’s something on your mind. Okay, the cafe is cool.”They went to the cafe together and sat down at one of the tables at the back. Kisha came straight to the point.“I’m Anara Sen’s sister,” she said.Immediately, Vedan’s face changed. He clenched his jaws, as if holding back an emotional outburst. But he composed himself pretty quickly. “Okay. So?” he asked, his words measured.“I just have to know …” Kisha looked around, then said in a low voice, “Did she woo you only to break your heart?”“She did woo me. And she did break my heart. To the extent that I started taking drugs. But thanks to my parents, I’m over all that now.”Kisha didn’t like what she just heard. Her Anara di being the reason for someone turning to drugs was horrible, even though Kisha knew it was a price her sister had to pay to get into THC, just like Kisha had to ignore certain collateral damages herself during her association with Ahaan.“But whether she wooed me only to intentionally break my heart, I don’t know. Why are you asking me all this?”“Can you please give me some details?”“What details?’“Anything you can remember. Of her wooing you maybe, or something about how it started?”“There’s nothing exceptional to talk about. Like every other boy in school, I always found Anara hot. But I knew she was out of my league, and I never really approached her. Then, one day, I noticed her looking at me. It wasn’t just another passing look, you know? It was as if she was suddenly interested in me.”Kisha remembered how she had begun to entice Ahaan when she was trying to woo him because of THC. She could imagine Anara doing the same thing with Vedan.“That triggered your romance?”“Afakeromance,” Vedan said with a shrug. “But why do you ask? I heard Anara is no more. Is it related to that?”“She was my sister. I’m just trying to collect as much information about the last few months of her life as possible. When or how did you understand that the romance was fake?”“I didn’t understand. That was the whole problem. I was too naïve. When it was happening, it sure didn’t seem fake. But looking back, I don’t know why I didn’t see it coming.”“See what coming?”“The break-up.”“Were you okay with it?”“No! Why do you think I turned to drugs to get over it? Till this date, I don’t know why it happened. She randomly stopped all communication. She ignored me on campus and blocked my number. It was like building someone’s hunger, and then suddenly removing every scrap of food from within their reach. I went mad. I hated her.” The moment Vedan uttered those words, he knew he had said too much. There was spite in his voice. “Look, I don’t have anything to do with Anara’s death. I hope you aren’t thinking that I’m that jilted lover who ended up killing her.”“Should I think that way, Vedan?” Kisha was simply playing with his mind, shooting in the dark, hoping she would get something concrete out of him about Anara … something that she didn’t know yet.“It’s true that I was upset about the break-up. Who wouldn’t be, especially the way it happened. But with time I accepted it simply because I always knew I was never good enough for her. I was happy knowing that we dated for some time. That’s all.”“When you called it a fake romance, was it only because she broke your heart without any rhyme or reason, or was there something more that happened?”“I guess I was just a distraction for her. Timepass, as they say.”So, he didn’t use the word “fake” because he thought she was pursuing him for THC’s black handshake, Kisha thought. “Did Tavish have a problem because Anara di was dating you?” she questioned.Vedan took a couple of seconds to reply. “I guess not. They were done by then. Or so I got to know. Why would she date me and Tavish together, anyway?”Because dating you wasn’t real, it was her black handshake, Kisha answered Vedan in her mind. “So, it was common knowledge that Anara di and Tavish were a couple?”“Not really. She told me they had dated when we got together.”So was Tavish right when he told me that Anara di was the one more inclined towards him?Kisha’s mind raced. “What do you know about THC?” Kisha asked.“The Heartbreak Club?”Kisha nodded.“Just what I’ve heard on the grapevine, like any other Fairmont High student. Wait a minute, do you think THC is responsible for –?”“Why? Is that improbable?”“No. I guess it makes sense that if anyone would have the guts to do something so heinous, it would have to be THC,” Vedan said after a short pause. Kisha understood Vedan wasn’t going to give her anything more on the matter. It was possible he didn’t know much more either.“Thanks, Vedan,” Kisha said and stood up.As she left the cafe, Vedan unlocked his phone and started browsing the pictures he had of Anara from the time when they had briefly dated. After learning of her disappearance, Vedan had sent all the images to his Instagram DM and deleted them from his gallery. As he looked at the old photos, he was aroused. The intense lust he harboured for Anara remained even after she was gone.“Still into Anara?” Vedan kept his phone away and turned around.It was Demi. Their families were close friends.“Nay!” Vedan said with a sly smile, as Demi caught up with him about life in London.Excerpted with permission fromNo Time to Blink,Novoneel Chakraborty, Westland.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.thrillerfictionRelatedA new book examines why Narendra Modi struggled for a big win in Varanasi in the 2024 electionsTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081948/caste-census-will-the-50-reservation-cap-soon-be-history",
    "title": "Caste census: Will the 50% quota cap soon be history?",
    "content": "The India FixCaste census: Will the 50% reservation cap soon be history?The India Fix: A newsletter on Indian politics from Scroll.Shoaib Daniyal3 hours agoRead in AppSONNY TUMBELAKA / POOL / AFPWelcome to The India Fix by Shoaib Daniyal. A newsletter on Indian politics (though this week, it intersects quite a bit with global politics).As always, if you’ve been sent this newsletter and like it, to get it in your inbox every week, sign uphere(click on “follow”).After the Pahalgam terror attack, much of India was expecting a retaliatory attack against Pakistan. Instead, Prime Minister Narendra Modi launched a surgical strike of a political kind. On Wednesday, the Union cabinet decided that caste would be counted as part of the upcoming census.This is a major U-turn by the Bharatiya Janata Party and Modi. Just a year ago, Modi had denounced those lobbying for a caste census as “urban naxals”. Uttar Pradesh Chief Minister Adityanath, arguably the second-most popular BJP leader after Modi, set the line for opposition to the caste census with the slogan “batenge to katenge” – divided we will get slaughtered.The graphic imagery refers to a long-held Hindutva belief that demands for caste equity will only end up fracturing Hindu society. The Rashtriya Swayamsevak Sanghbacked Adityanathon his call for purported Hindu unity.Soon ModiechoedAdityanath’s line with his own “ek hai to safe hai” – there is safety in unity. Clearly, the BJP was going hammer and tongs against the Congress party, which has pressed hard for a caste census as part of its social equity focus under the leadership of Rahul Gandhi.An about turnThat the saffron party has turned on a dime and now sought to take credit for the caste census is a good indicator of just how popular the policy plank is. Clearly the BJP hopes to blunt some of the Dalit and Other Backward Class anger that led to it losing the support of these groups in the last Lok Sabha elections.But even as the BJP is trying to run off with the Congress’ agenda, the main Opposition party  has stepped up its game: it says it will now concentrate on getting the government to remove the 50% cap that has been set on reservations for seats in educational institutions and government jobs.If it happens, it would cause a political earthquake that could be bigger than even the anti-Mandal agitation of the early 1990s. In 1990, the VP Singh government implemented the Mandal Commission’s recommendations, providing reservations to Other Backward Classes – a vast, varied collection of agricultural and artisanal castes that fall between upper castes and Dalits in the social ladder.This doubled caste quotas to nearly 50%, drastically shrinking the general category dominated by upper castes. Angry at this, members of the upper castes launched an agitation with a young brahmin student, Rajiv Goswami, even setting himself on fire in Delhi.This agitation was mirrored by a new politics of OBC assertion, especially in the Hindi belt. Parties such as the Samajwadi and the Rashtriya Janata Dal drew OBC votes away from the upper caste-led Congress with the claim that  OBC interests would be better protected by OBC leadership.Judicial awardEventually, a political compromise was hammered out – not by politicians but by the Supreme Court of India. In the landmark 1992 Indra Sawhney judgment, the court upheld OBC reservations but also put in place significant caps. Reservations could not extend beyond 50% and the “creamy layer” or well-off OBCs would be excluded from availing of the quota.Notably, the court did not really explain why it chose the 50% figure. It said that the power of reservations should be “exercised in a fair manner and within reasonable limits” and hence “reservation under Clause (4) shall not exceed 50% of the appointments or posts, barring certain extraordinary situations as explained hereinafter”.But why was 50% a “reasonable limit” given that Dalits, Adivasis and OBCs constitute around 80% of the Indian population?Even more confusingly, in 2022 the court allowed this 50% limit to be breached for the Economically Weaker Section quota for poor members of the upper castes. The Indra Sawhney cap was only applicable to caste quotas, it held.That such a major policy decision was taken by the court and not backed up in the political sphere meant the 50% cap was always on weak ground. The court in fact struck a blow of its own by upholding the Economically Weaker Section quota.Caste societyIndia is the only country in the world where affirmative action quotas extend to the majority of the population. With the Economically Weaker Section quota in place, it now stands at almost 60%.Part of this flows from just how unique Indian society is. For example, the endogamy that underpins it, with the idea that marriages must only take place within a caste or even a subcaste, has shocked geneticists. Famously, David Reich, a geneticist at Harvard University, quipped that while the Chinese are a truly large population, Indians are actually a “large number of small populations”.Given this hermetically sealed social structure, the vast majority of Indian castes do not feel they can ever compete with the savarna castes that have dominated the social system for the past two millennia.Add to this is the fact that the Indian economy has been terrible at creating employment. In fact,studiesshow that there is little relationship at all between economic growth and employment growth in India.“What this means is that far from employment growing faster when GDP grows faster, years of fast GDP growth have, on the contrary, tended to be years of slow employment growth,” theState of Working Indiareport 2023 said.Both these factors mean that almost everyone in India thinks they need state-backed quotas to access wealth and education. Hence, the massive support for removing the quota cap.Modi has bent to Rahul Gandhi on the caste census. Will he now also buckle on the 50% limit?Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.caste censusCaste reservations50% capRelatedModi-Trump bhai bhai: Can there be a global right-wing coalition?TrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081589/hindi-the-national-language-that-marginalises-its-own",
    "title": "Hindi: The ‘national language’ that marginalises its own",
    "content": "language politicsHindi: The ‘national language’ that marginalises its ownBeyond the narrow confines of Hindi lie histories of rich literary traditions, exclusion, a stepping stone to access and deep resistance.Charu SinghMay 02, 2025 · 09:00 amRead in AppStamps of  Hindi Day and Pratap Narayan Mishra against a representative background of a table of some Indian languages, as recorded by German Indologist AFR Hoernlé in 1880.\n    \n    \n       |\n    \n    Post of India, GODL-India and \"A Comparative Grammar of the Eastern Hindi by AFR Hoernlé, via Wikimedia Commons.Two centuries of discourse around language and identity in India have culminated in Hindi emerging as a nationalist symbol – as the language of the Hindu nation. Nearly 150 years ago, the essayist Pratapnarayan Mishra coined the slogan “Hind, Hindu, Hindi”, an early articulation of the majoritarian refrain “Hindi, Hindu, Hindustan”. It is, therefore, unsurprising that such a language would encounter regional resistance.The languages that Hindi now seeks to dominate in its role as the Hindu language exceed it in literary maturity and historical depth. The history of Hindi extends back no more than two centuries. This is why, particularly in the context of South India, Hindi often appears as a language of imposition and cultural zealotry.Consequently, every Hindi speaker who steps beyond their regional or linguistic comfort zone is viewed with suspicion. In academic settings, this suspicion intensifies – at times, being manifested as outright rejection or resistance towards Hindi speakers.However, this ignores a deeper truth: students and scholars who enter higher education through Hindi do not do so from positions of privilege. More often than not, they are women, Dalits, the rural poor, or working-class families from small towns for whom the only real choice was between under-resourced Hindi-medium schools and no schooling at all.The region commonly called the “Hindi belt” is inhabited by communities who rarely use Hindi in their domestic lives. In this context, Hindi functions primarily as a language of work – an acquired language rather than a mother tongue. Their native languages have distinct linguistic traditions such as Bhojpuri, Maithili, Braj, and Awadhi. For them, Hindi has never been a symbol of dominance but a domain of exclusion. First, because of their mother tongues and now, ironically, because of Hindi.Contemporary discussions often attempt to explain this history of Hindi’s rise to dominance through the lens of the Hindi-Urdu divide. This important frame becomes limiting when the split is seen merely as an administrative accident. In an article inThe Indian Express, linguist Peggy Mohan suggests that the division between Hindi and Urdu was primarily the result of a government classification of scripts issued in 1900.However, this interpretation flattens the longer, more complex history of linguistic struggle in North India.The ideological separation of Hindi and Urdu began much earlier, with the establishment of Fort William College in Calcutta in 1800. Under the direction of John Gilchrist and other British orientalists, the spoken khari boli of North India was divided into two standardised forms: one, written in the Nagari script, became Hindi; the other, composed in the Arabic-Persian script, was accepted as Urdu.A copper plate manuscript in Sanskrit, written in the Nagari script, circa 1035 CE. Credit: in public domain, via Wikimedia Commons.This linguistic division certainly hardened when the colonial state passed the 1900 order granting official recognition to Nagari Hindi alongside Urdu. However, to locate the roots of this conflict solely in colonial administration is to fall into an overly simplified reading of history. Poetic compositions in bhākhā – a premodern register of Hindi used in devotional and poetic traditions – had existed alongside the world of Urdu poetry well before the interventions of Gilchrist and Fort William College, and they confirm the long-standing practice of writing Hindi in two distinct stylistic traditions.What did shift, however, was that in the aftermath of the script conflict in the United Provinces, the cultural claim over language became so deeply internalised that Hindi began to see itself as the language of all Hindus in Hindustan.Hindi first claimed authority over its neighbouring languages, whose ancient literary traditions were appropriated through a nationalist ideology. In doing so, Hindi activists carried out two simultaneous moves. First, by presenting Bhojpuri’s Kabir, Braj’s Surdas, Awadhi’s Tulsidas, and Apabhramsha’s Chand Bardai as part of an ancient literary reservoir, they strengthened Hindi’s historical legitimacy vis-à-vis Urdu.Stamps depicting Kabir, Surdas and Tulsidas. Credit: India Post, Government of India, public domain, via Wikimedia Commons.At the same time, by invoking these figures from other regional languages, they positioned Hindi as the people’s language – the authentic vernacular of India – while casting Urdu as the language of foreign Muslims. All of this occurred around 1880, well before the aforementioned government order.This history makes it strikingly clear that the category of “Hindi speakers” is itself a fiction. What census reports and public discourse describes as “Hindi” is, in fact, a collection of highly diverse languages – Bhojpuri, Maithili, Braj, Magahi, Awadhi, Chhattisgarhi, Bajjika, among others – each of which is linguistically distinct and has a long literary and oral tradition.However, these languages have now come to be absorbed into what is called the history of Hindi. Stripped of their own literary traditions and historical identities, they have been reduced to mere dialects of Hindi. In the regions labelled within English-speaking academia as the Hindi Belt (or the derogatory “Cow Belt”), there are still tens of millions of people who, in their entire lives, have never spoken what is officially called Hindi.However, for most people counted among these so-called Hindi speakers, language is not a seat of power but a narrow corridor of access – the only path left open when all others are shut. If someone from this background eventually reaches an elite university and enters the academic world, they encounter a second wall of exclusion. The Hindi-medium education that once enabled their survival becomes the very reason they are no longer taken seriously. They are viewed as provincial, lacking in theoretical understanding, and incapable of participating in the real work of critique and research.A painting of King Prithviraj Chauhan hunting a tiger, with Chand Bardai beside him, Jodhpur, circa 1830. Credit: in public domain, via Wikimedia Commons.In the Hindi literary field, upper-caste men continue to dominate the canon. When women, Dalits, or scholars from other backward classes question canonical texts or challenge prevailing literary values, they are often dismissed as insufficiently refined, lacking in literary sensibility, or lacking theoretical training. At times, they are accused of politicising culture.In this way, Hindi becomes the means of their academic entry and the reason for their double exclusion. They cannot renounce it because it is their intellectual home. However, English – an elite world to the point of being alienating, even colonising – stands on the other side. Both spaces continually remind them that neither truly belongs to them.In today’s academic discourse, a strange fantasy circulates – that the answer to Hindi’s nationalist politics is to abandon it, adopt English, stop teaching or writing in Hindi, and embrace “modernisation”. Some critics even argue that because Hindi is marked by Brahminical dominance, it should be entirely boycotted by Dalits.However, one must ask: how is the Dalit student from a village, especially a girl, meant to access education? Should she boycott education itself in order to boycott Hindi? Moreover, what about the woman writer who learned to intervene through Hindi – should she stop reading and writing altogether for fear of being labelled a supporter of Brahminism?This elite demand fails to acknowledge that switching linguistic gears is difficult and impractical for those who grew up in Hindi and often had no access to English. It is not a socially just solution. It also erases the decades of struggle through which they made intellectual life possible in Hindi. Language is not just a medium: it is a memory of resistance. To walk away from it is not liberation. It is the erasure of a history of struggle.The Hindi public sphere has been undergoing a slow but profound transformation over the past two to three decades, especially since the 1990s. Women, members of the Other Backward Classes, Dalit and Muslim writers, critics, artists, and readers are actively reconfiguring what counts as literature and criticism and who has the right to speak in and through Hindi.These interventions are not merely linguistic or stylistic. They question the norms of Hindi literary tradition, challenge gender roles, confront the silencing of caste, gender and Muslims, and directly face the exclusions that have long been celebrated as part of Hindi’s literary canon.These voices are not rejecting Hindi. They radically inhabit it – demanding that it make space for questions and perspectives that have long been suppressed or ignored.At precisely this moment, attempts to purge Arabic-Persian vocabulary, construct a South-North binary and invoke cultural nationalism through the state-sponsored promotion of Hindi risk undermining this emerging democratic space from within.Across the country, arguments about so-called Hindi hate or Hindi resistance are increasingly used to silence the voices of those already marginalised. In the Hindi literary world, writers, particularly women, Dalits, and those who dissent, are pressured either to assimilate into the existing hierarchical framework or risk erasure altogether.This forced consolidation threatens to undo decades of grassroots transformation. If we fail to recognise and protect the diversity within Hindi, we may lose the very possibility of a democratic Hindi public sphere.Hindi today is not a unified tradition but a site of unresolved tensions. Preserving this character of Hindi is essential to preserving democracy in this country. Moreover, this cannot be achieved through elite anger, impulse, or resentment. It can only be accomplished through a nuanced understanding of the present moment and a deep commitment to the diversity within Hindi itself.Charu Singh teaches Hindi at Ahmedabad University.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.HindiLanguageLiterary TraditionsRelatedHindi useful for communicating in Delhi, says Chandrababu Naidu amid row over language policyTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081090/how-adivasis-are-fighting-to-protect-their-sacred-groves-from-destruction",
    "title": "Jharkhand: The Adivasi fight to protect sacred groves from destruction",
    "content": "Common GroundHow Adivasis are fighting to protect their sacred groves from destructionSymbols of the Adivasi community’s deep cultural ties with the environment, these sites are being steadily encroached upon in Jharkhand.Nolina MinjApr 10, 2025 · 06:30 amRead in AppDesign | Rubin D’SouzaOn the morning of March 7, hundreds of Adivasis dressed in traditional garb formed a human chain in the city of Ranchi.The chain stretched across two kilometres, from Harmu chowk to Argora chowk, a route through which Jharkhand’s chief minister Hemant Soren was expected to pass on his way to attend the budget session of the assembly.Protestors waved red and white striped flags, which represent the traditional Sarna faith of Adivasis in the region, and shouted, “Jharkhand sarkar, hosh mein aao!” – Jharkhand government, come to your senses.They were protesting the recently completed construction of a ramp of the Siram Toli-Meccon flyover project in the Siram Toli area. Authorities claim that the flyover, which will span more than two kilometres, will reduce traffic congestion in the rapidly growing capital city.But the Adivasi community is concerned because the end of the ramp is situated just a few feet from a site that holds immense social and cultural value to them: a kendriya Sarna sthal, or central sacred grove, which draws lakhs of visitors each year.This is only the latest move that they say is eating into the grove’s land.In 2022, the state’s welfare department took up a beautification plan that cost almost Rs 5 crore and included the construction of a building and a stage in the grove. In 2023, authorities encroached a little over 1,300 square feet into the grove to make space for the flyover. Now, with the ramp’s construction, the Adivasi community fears that traffic will enter Siram Toli right in front of the grove, which will further shrink the space around it.“We first raised our voices when the site was encroached last year,” said Sukhram Kachhap, a local leader from the Sarna community, whom I met a few days later at Siram Toli. Construction work inside the site for its beautification was still underway. “But then we had a community meeting and we thought we would part with some of the land for the greater good – for development,” he explained. “We had no idea that the ramp would be constructed right in front of the Sarna sthal.”The community’s fears over the destruction of the site are part of larger concerns that sacred groves across the state are steadily being encroached on. They argue that these groves are a central aspect of the faith, culture and way of life of the state’s Adivasis. They are also symbols of the community’s deep social and cultural ties with the environment.The community is particularly distressed because the state is currently governed by a coalition government led by the Jharkhand Mukti Morcha, which claims to represent Adivasi interests. To woo Adivasi voters, the party prominently used the slogan “abua raj, abua sarkar”, or “our own state, our own government”, in its 2024 assembly election campaign.On March 7, protesters formed a human chain in Ranchi to protest against the construction of a ramp that they say encroaches into a sacred grove of the Adivasi community. Photo: Nolina MinjAs a show of disappointment with the state’s lawmakers, on March 16, a coalition of Adivasi organisations held symbolic funeral rites for the 30 Adivasi MLAs in the state assembly at Albert Ekka chowk, a central area in Ranchi.The activist Gladson Dungdung described it as “most tragic” that such encroachments were happening “when the chief minister, the leader of opposition and 30 MLAs in power are all Adivasi”. He said, “Is this an abua sarkar or a dummy sarkar? Who is actually running this government?”He noted that the state has a long history of such encroachment. “In 1927, Tata took over a deshauli of the Ho community in the Saranda forests to open a steel plant,” Dungdung said, referring to a type of sacred grove. “After many protests, they were allowed to visit it once a year to worship there.”Those protesting the ramp say that a much larger idea is at stake – that sites sacred to Adivasi communities face destruction because they do not typically resemble those of mainstream religions.“Across Ranchi you will find temples that have cropped up on busy roads in recent years and nobody has uttered a word in their opposition,” said activist Sushma Biruli. “These are new buildings. Our sacred sites, including sacred groves, are several years old and registered in government documents. But these very sites end up being encroached, whereas new roads being built near temples are rerouted so that they don’t cut through temples.”Activists burn a picture of Jharkhand chief minister Hemant Soren. The Adivasi community is particularly disappointed that an Adivasi leader has failed to curb the destruction of a sacred site. Photo: Nolina MinjOn March 22, Adivasi groups held a bandh to protest the flyover ramp at Siram Toli and threatened to destroy it – a key demand was that the ramp be removed before Sarhul, the most popular annual festival of the Sarna Adivasis, held on April 1 this year.  On March 28, the administration told protestors that a portion of the ramp would be cleared to facilitate the smooth celebrations of Sarhul.Two days later, however, protestors, led by the former state education minister Geetashree Oraon, clashed with the police as they wanted the entire ramp removed. Some, who were carrying axes, attacked the ramp, damaging it.On April 1, when the chief minister visited the Sarna sthal to worship there on the day of Sarhul, Oraon with a few members of the community gathered at the site to protest, wearing black bands on their heads as a mark of protest.Manjunath Bhajantri, the deputy commissioner of Ranchi said that before January, there had been no opposition from the community and claimed that there were vested interests behind the current protests. “There are some individuals with political interests who are misguiding the community,” he said, though members of the community denied this charge. “If we are to redo this, it will take another three years to redesign and rebuild the flyover,” Bhajantri said. “Then, too, there is no guarantee that everything will be approved by all communities.”This story is part ofCommon Ground, our in-depth and investigative reporting project. Sign uphereto get the stories in your inbox soon after they are released.Amongst Jharkhand’s Adivasi communities, a sacred grove is typically a patch of forested land that the community conserves and uses for various rituals and prayers.Traditionally, every Adivasi village in Jharkhand had its own sacred groves in its outskirts. “A single village can have four or five groves,” said cultural activist Gunjal Ikir Munda. “Different groves serve different purposes. Some are used to celebrate Sarhul or the hunting festival Sendra, while others are dedicated to specific deities.”Many sacred groves are patches of land that were set aside by the first Adivasi settlers in the region. They were typically maintained without enclosures, with borders only roughly marked by stones. This lack of demarcation made them prone to encroachment, activists note, particularly in areas like Ranchi that have seen rapid urbanisation and population growth. Thus, in many parts of the state, the Sarna Adivasi community, often with the support of the state government, has taken steps to protect these sacred sites, such as constructing concrete walls.Part of the sarna sthal in the locality of Purani Ranchi, with a sign asking that it not be dirtied. The lack of demarcation made these spaces prone to encroachment, particularly in areas like Ranchi that have seen rapid urbanisation. Photo: Nolina MinjExperts see these measures as particularly vital because of the environmental importance of the sites. “The preservation of sacred groves is closely linked to the cultural practices and beliefs of local communities, making a strong connection between cultural heritage and biodiversity conservation,” researchers at the Institute of Forest Productivity in Ranchiwrotein a January 2025 paper.Further, the authors noted, “The protected groves have rich genetic reservoirs, preserving genetic diversity of several plant species. This diversity is crucial for the adaptation and survival of species under changing climatic conditions.”Adivasi intellectuals, too, assert that sacred groves serve as an example of how environmental conservation is embedded in the cultural and religious practices of Adivasi communities.“Through our folklore we are told that when the ancestors were clearing land for agriculture, they realised that it was important to preserve the jungle, and so they decided to leave large areas of trees undisturbed for the gods,” said Dr Meenakshi Munda, assistant professor of anthropology at Kolhan University.Munda explained that in many groves it was forbidden to cut any part of trees, while in others, branches and leaves could be trimmed, but cutting trees entirely was forbidden. “This resulted in huge areas being preserved as community forests, which preserved the biodiversity of that area,” she said.Onepaperon tribal religion and biodiversity conservation noted that there are several factors behind the decline of sacred groves, including “grazing, ecotourism, fragmentation of the grove-owning families, greed, poverty, overexploitation, development, government policies, irresponsible behavior by corporations and erosion of cultural and religious beliefs”.The Siram Toli grove is a prime example of such a site. “This is the most important sacred grove for all of Chota Nagpur,” said Abhishek Bhagat, a young student from Lohardaga district, who travelled to Ranchi in early March to participate in the human chain protest. “If its boundaries have not been respected, can you imagine what the condition of other sacred groves in the state must be like?”The grove holds particular socio-cultural significance for the state’s Adivasis because the community has fought fiercely over decades to protect it.In 1961, non-Adivasi settlers from Punjab began planning to cut the grove down to make way for a factory. However, when the prominent Adivasi leader Kartik Oraon heard about this, he intervened and ensured that their plans did not go forward.Oraon and other Adivasi leaders then began the tradition of holding a procession on the day of Sarhul, for which people from the surrounding neighbourhoods would assemble at the grove. “They thought of how the grove could be saved for future generations and realised that more people would have to visit it,” said Geetashree Oraon, Kartik Oraon’s daughter.In the 1980s, this annual tradition was reinforced by leaders like Ram Dayal Munda, who donned traditional Adivasi garments and sang and danced in the procession. “The procession became an assertion and celebration of Adivasi presence and cultural identity, which was being lost in Ranchi,” Gunjal Ikir Munda, the leader’s son, said.Adivasi community members in Ranchi argued that the sarna sthal was a vital gathering space, and that lakhs visited every year. A ramp that constricted its entrance area posed a safety risk, they said. Photo: Nolina MinjOver the years, the number of people who participated in the procession grew steadily. Currently, lakhs of Adivasis in Ranchi and different parts of the state visit the sacred grove in Siram Toli each year to celebrate Sarhul.Activists argue that given the site’s popularity, encroaching the space of the grove could also compromise visitors’ safety. “There are accidents happening in the Kumbh mela, despite the space for the mela being huge,” said Geetashree. “But here the space is already so small, how will lakhs of people get inside? This is an assault to the dignity of our community and could lead to stampedes.”Along with fears that sacred groves are being encroached upon, some community members are also concerned about official moves to change their nature, especially in urban areas like Ranchi. Since 2016, for instance, the state government’s social welfare department has constructed boundary walls around sacred groves across the state, ostensibly to safeguard and protect them from encroachment.This has been a concern at Siram Toli also – as part of the 2022 beautification plan, the state welfare department laid paver blocks on the ground of the grove, installed concrete rings or metal bars around the trees and erected a three-storeyed building, called Sarna Bhawan, on the site.The sarna sthal at Siram Toli. Though at first Adivasi sacred sites were unfenced and unprotected, over the years to protect against encroachment, walls and other structures came up in many of them. Photo: Nolina Minj“Beautification is alright, but what happened in its name changed the very nature of the sacred grove,” said Sukhram Kacchap.At the same time, Sukhram and others also noted that the beautification plans caused a divide amongst the community members: while Adivasis who were city-bred aspired to have a building inside the grove, akin to how other religions have temples and churches, those from villages did not want any disturbance to its environment.“We live in harmony with nature, so our sacred grove should also remain natural,” said Bhagat. “Why do we need a building when we have the earth? We didn’t want air conditioners because we are used to the wind from the trees.”Some Adivasi intellectuals shared these concerns, even as they maintained that it was important to protect sacred groves. “It is the nature of things to change, and enclosures have become necessary to protect sacred groves,” said Mahadev Toppo, a poet. “However, the groves should remain in harmony with nature, because that connection is the very foundation of Adivasi identity.”Gunjal explained that this was not a minor concern, and that the visual characteristics of sacred groves were central to Adivasi culture. “It is difficult to explain other aspects of the Sarna faith, but the worship of trees is the most visually memorable element of Sarna culture,” he said. “It shows our connection to nature and practices of environmental conservation. But with the onset of the concretisation of sacred groves, this easily noticeable visual is also changing.” He noted that in one particularly striking instance, “in Kanke area of Ranchi, there is a sacred grove where a tree has been constructed from cement”.The problem was a complex one, Gunjal noted, explaining that even as such processes eroded the original nature of groves, they also protected them by marking them out in ways similar to how dominant religions marked their sites. While trees in an open field are vulnerable and easy to destroy, he observed, demolishing a built structure such as a temple can lead to far more serious repercussions. “There is a discourse about Adivasis being different from other mainstream religions,” he said. “At the same time, urbanisation is creating pressures for us to become like others. It is important to protect sacred groves, but how exactly do we do this? There is no right or wrong way. But in doing so, are we able to sustain our ancestral values of environmental conservation?”Social worker Ashok Bhagat warned that changing the physical form of a sacred grove was often the first step in changing its religious identity. “That’s how the Adivasi identity ofDeoristhal changed and it became a Hindu temple,” he said. “First, they built an enclosure, then they put idols inside, finally the temple came up.”On March 7, some women protestors said that the construction of enclosures restricts the movement of the goddess said to reside in sacred groves. “Sarna maa is said to roam all over the village to protect it,” said protestor Poonam Tigga. “How will she roam around if we enclose her within walls”.Ultimately, as the encroachment of Siram Toli shows, even the construction of enclosures does not always ensure the protection of sacred groves. “Thousands of sacred groves in Jharkhand have been wiped out in the name of development,” said activist Gladson Dungdung at the protest. “The very faith and identity of Adivasis is under attack.”Sacred groves are not the only traditional sites under threat. “We Sarnas have multiple sites such as sarna sthal, masna sthal, marai sthal, deshauli, akhra, dhumkuriya, which are considered to be sacred and are an integral part of our community’s spiritual and cultural practices,” said Ashok Bhagat.Mahadev Toppo explained that all these sites were interconnected through rituals and functions, and had an important role to play in the cultural ecosystem of the Sarna community.Among these kinds of sites are the daari, water reservoirs whose functioning is linked to that of the sacred groves. “The water of the daari is essential to perform our rituals for weddings, births and funerals,” said Bashanti Kacchap, a resident of Pokhar Toli, a village on the outskirts of Ranchi city.On the afternoon of March 20, I visited Pokhar Toli, which is around two kilometres from the airport, and close to an army camp.The day was scorching at about 32 degrees Celsius, as I walked on a barren ground to reach the Sarna sthal, where I was to meet a group of Sarna women from the village. But upon reaching the grove, there was a palpable coolness under its tall trees, which provided a large patch of shade to those who stood underneath. A stone slab read that the grove had been established in the year 1808.Sarna women at the sarna sthal in Pokhar Toli. Locals observed that the grove of a neighbouring village waas acquired for an airport years ago, and now residents can only visit it once a year. Photo: Nolina Minj“The sacred grove of the neighbouring village in Hinoo was acquired by the airport several decades ago,” said Bashanti.“Since then, people are only allowed to visit it once a year, on Sarhul. And now, we are fighting to save our daari.”Bashanti explained that since non-Adivasi communities began settling in the village, around three decades ago, traditional community land in the village, known as bhuinhari land, was taken over bit by bit until just a little over 3,000 square feet were left, on which the daari was situated.A few years ago, locals recounted, a non-Adivasi settler from Bihar bought the plot next to the daari. In 2022, the Sarna community decided to put a boundary around the daari to protect it from encroachment. However, the settler filed a petition in the Jharkhand High Court demanding that the boundary be taken down so that she could construct a road leading to her house.The community was taken by surprise with the case. Asked to appear at court with just a day’s notice, they scrambled to find a lawyer who could represent them. “He didn’t fight for us properly and we lost the case,” said Meena Toppo, another resident of Pokhar Toli.Bashanti said that government officers, including the subdivisional officer and the deputy superintendent of police, prepared reports for the case that stated that the daari was a sacred site for the Sarna community and arguing that it should not be interfered with – but the court did not pay heed to them.Some years ago, a non-Adivasi settler in Pokhar Toli filed a case in the Jharkhand High Court demanding that the daari wall be taken down so that she could build a road to her house. Locals’ efforts to challenge this were unsuccessful. Photo: Nolina MinjThe daari is situated at a five-minute walk from the village’s sacred grove, past houses and temples with tall boundary walls.On walking to it, we came up to an open ground with overgrown vegetation, large chunks of concrete, plastic waste and animal faeces. The daari itself, a small water reservoir, like a well, was barely visible amidst the waste. When I peered inside, I saw a bag of cement floating inside it. As Meena Toppo walked around the site with me, she burst into tears. “Have you ever seen the sacred site of any other community in such a terrible state?” she said. “Why does this only happen to Adivasis?”At the far end of the ground stood half-constructed rooms of bricks. “We had planned to construct a small classroom space there so that children from the neighbourhood could come learn Kurukh, and other cultural practices,” Meena said. But, she added, they were forced to halt the construction because the settler had sought that same land for the construction of the road.The community fears that their Sarna sthal might also be at risk, particularly since it does not have an enclosure. “We collected money in the community and tried building an enclosure in 2022 itself, but it was broken down by the soldiers from the military camp,” said Basanti. “They said that this land comes under their jurisdiction and we are not allowed to put up an enclosure. We have drunks coming here at night and dirtying the place.”Traditionally, a daari is a water reservoir used for various community ritual. But the daari at Pokhar Toli an open ground with overgrown vegetation, large chunks of concrete, plastic waste and animal faeces. Photo: Nolina MinjResidents of the neighbourhood of Purani Ranchi in the city find themselves in a similar predicament. Deep inside the neighbourhood, which is one of the city’s oldest and is packed with houses and shops, are three open spaces for a dhumkuriya, or a traditional educational centre, a Sarna sthal and a daali katari field of the Kurukh Sarna community.In late January last year, the community found itself plunged into a dispute over the field, after staff of a builder claimed that the family of the community’s pahan, or priest, had sold him the land. They were surprised to hear this, since traditionally, the daali katari land was agricultural land that the community gave the priest for his services. “It is communal land. It cannot be sold off to someone,” said local leader Vijay Oraon. “Historically this land was passed on from one pahan to another as they changed.”The daali katari, or community field, in Purani Ranchi. Last year, a builder claimed that the community’s priest had sold him this land, though residents dispute that he had the power to do this. Photo: Nolina MinjIn fact, today the community continues to use the land despite the conflict over it. “The money for all the rituals of the community comes from the produce grown from this land,” said Oraon.Atul Kerketta, a local leader, explained that the community did not only use the field, but also regularly performed rituals on it. “When there’s a temple or a mosque, people easily see the architecture and understand that it’s a sacred site,” he said. “But they don’t know that our groves and fields are also sacred.”A few days after meeting the builder’s staff, locals found that enclosures had come up around the field overnight, and that CCTV cameras had been installed to monitor it. Community members went to the local police station to lodge a complaint. When they did not receive immediate help from the police, they decided to break down the enclosure of the field. Since then, the builder has lodged a case against local leaders, and locals have lodged a counter-case against them.Now, like the residents of Pokhar Toli, those of Purani Ranchi also feel that they need a wall to protect the community’s land.“Ideally an agricultural field should not have concrete boundaries as it obstructs the flow of water,” Vijay Oraon said. “But we are collecting money and planning on constructing a wall for its protection.”In fact, the locality’s Sarna sthal already has an enclosure. The community decided to build one because, in the early 2000s, after Jharkhand became a separate state from Bihar, the neighbourhood began to grow at an accelerated rate – during this time, new residents entered the grove and cut down trees at night.Vijay Kerketta (left) and Atul Oraon (centre) at the sarna sthal in Purani Ranchi. The community built an enclosure after Jharkhand became a separate state, and encroachments increased rapidly. Photo: Nolina MinjToday, the trees at the heart of the sacred grove are surrounded by concrete walls, and another enclosure made of bamboo sticks forms a wider perimeter.But the two enclosures do not encompass the entire area of the sacred grove. “We’ve put up the enclosures using our own money, so it was expensive to cover such a huge space,” said Kerketta. “But now we see that we have no choice. People have begun dumping garbage here. They wouldn’t do this in front of a temple or mosque, but they do that here. So slowly, we’ll expand the enclosure.”Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.LandAdivasisJharkhandSacred grovesRelatedHow Kerala’s trade unions have failed womenTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1081965/divine-right-of-demagogues-why-authoritarians-cant-stop-playing-god",
    "title": "Donald Trump’s AI-generated image as Pope: Why authoritarians can’t stop playing god",
    "content": "Holy smokeDivine right of demagogues: Why authoritarians can’t stop playing godTheir trick is simple: first break the world, then sell yourself as the only one with the sacred power to fix it.Pius Fozan4 hours agoRead in AppUS President Donald Trump posted an AI-generated image of himself on social media in papal robes.\n    \n    \n       |\n    \n    @WhiteHouse via TwitterWhen US President Donald Trump and his White House on Saturdaypostedan AI-generated image of him seated like a baroque ornament on the throne of St Peter, papal hat, gilded robes, the kind ofnarcissistic fantasythat would make Mussolini blush, he was notjoking. Not really. His followersthoughtit was funny. It was. In the same way a clown holding a nuclear briefcase is funny: until it is not.A faction of Republican senators like Lindsey Graham, presumably suffering from long Covid of the conscience,proposeda “conclave” to anoint Trump as the next pope. Graham asked “the papal conclave and Catholic faithful to keep an open mind about this possibility!”Meanwhile, across the Atlanic Viktor Orbán, a Trump wannabe and ever the aspiring Calvinist strongman, has been turning the Hungarian parliament into a confession box where sins are forgiven as long as you vote Fidesz.Even in India, Prime Minister Narendra Modi, confessed to an interviewer some time ago that he does not believe that he could have come from a“biological body”.And why this attempt by politicians to demonstrate their proximity to the supreme beings?Because authoritarianism, by design, is never solely about power. It is about pursuit of divinity. It is about manufacturing belief.Authoritarian leaders do not want togovernthe people. They want tobecomethem. They do not ask for a mandate: they proclaim miracles. Trump has never been shy about hiswish to be a kingand adictator.Authoritarian leaders are the last messiah before the apocalypse, the only surgeon qualified to remove the tumour they themselves nurtured. Their trick is simple: first break the world, then sell yourself as the only one with the sacred power to fix it.This is beyond politics. It is performance art. Stagecraft, complete with smoke machines, ambient chants and the occasional lynching. The problem is: the audience is unruly, diverse, and often educated. Not everyone claps at the same time or all the time. The authoritarian, unable to tolerate silence, solves this by conjuring a new audience – one that is always grateful, always amazed, and crucially, never leaves the theatre.It is a cult.To build a cult, you need faith. To manufacture faith, you need propaganda. And to run a propaganda machine, you need something far more sinister than ideology: you need logistics. Algorithms, image consultants, nationalism in a Ghibli-style ChatGPT-generated image.The modern authoritarian wear robes, but most exceptionally, they wear metadata. Their miracles are Photoshopped. Their sermons are pre-recorded. Their gospels are delivered not on stone tablets but in WhatsApp and Telegram groups.And yet, the masses still believe. Because belief is never about facts. It is about the fear of unknown. It is about longing.Longing for order. For justice. For meaning. These politicians, often men inject a sense of divine clarity, however misplaced and unreasonably illogical, into a chaotic world.They speak in absolutes, banish ambiguity and offer certainty in an age allergic to nuance, to context, to truth. They become gods, not by ascending, but by descending, stooping low enough to lift themselves onto our shoulders, crushing us under the weight of their manufactured sanctity.And so, while England’s Henry VIII created a church to divorce his wife, today’s authoritarians create religions to marry power. Their desire is not sated by being heads of state: they want to be prime priests, pontiffs, the supreme heads of faith.And once the state becomes a church, a temple, a mosque, a synagogue, disagreement becomes heresy. Dissenters are no longer wrong; they are sinners. And sinners deserve excommunication.This is not satire. This is where satire retires in despair.Pius Fozanis a photojournalist and public policy graduate from the Willy Brandt School and Central European University.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.Donald TrumpNarendra ModiViktor OrbánTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  },
  {
    "url": "https://scroll.in/article/1080773/why-has-a-genre-of-music-that-evokes-images-of-despair-and-destruction-become-a-popular-sleep-aid",
    "title": "Why has a genre of music that evokes images of  despair and destruction become a popular sleep aid?",
    "content": "sleep scienceWhy has a genre of music that evokes images of  despair and destruction become a popular sleep aid?The paradox of post-apocalyptic ambient music and the attention economy.Zakir Kibria40 minutes agoRead in AppPrototyperspective, CC0, via Wikimedia CommonsIn the quiet hours of the night, when the world is supposed to be still, millions of people are turning to a peculiar genre of music to lull them into sleep: post-apocalyptic ambient music.This genre, often described as “music to survive nuclear winter”. is characterised by its haunting, atmospheric soundscapes, punctuated by white noise, distant echoes, and a sense of desolation. It is a soundtrack for a world that no longer exists, or perhaps one that has yet to come.But why has this music, which evokes images of destruction and despair, become so popular as a sleep aid? What does it say about our collective psyche, our relationship with anxiety, and the relentless demands of the attention economy?PlayThe seduction of despairAt first glance, the idea of falling asleep to the sound of a world in ruins seems counterintuitive. Shouldn’t the thought of nuclear winter, with its barren landscapes and endless darkness, fill us with dread? Yet, for many, this music has become a form of solace. It is as if the very horror of the imagined apocalypse has been transformed into a sedative, a way to quiet the mind and ease the body into sleep.But how does this transformation occur? What happens in the cortex when we listen to these sounds of desolation?One possible explanation lies in the concept of “controlled exposure”. By immersing ourselves in a simulated version of our deepest fears – whether it be nuclear war, environmental collapse, or societal breakdown – we gain a sense of mastery over them. The music becomes a safe space where we can confront our anxieties without being overwhelmed by them.In this way, the post-apocalyptic soundscape acts as a kind of cognitive therapy, allowing us to process our fears in a controlled environment. The white noise, the distant hums, and the eerie melodies create a buffer between us and the chaos of the world, offering a temporary reprieve from the constant barrage of information and stimuli that characterise modern life.French cultural theorist Paul Virilio’s work on “dromology” – the study of speed and its impact on society – sheds light on this phenomenon. Virilio argues that the acceleration of technological and social processes has created a state of “permanent emergency”, where the future feels perpetually uncertain.In this context, post-apocalyptic ambient music can be seen as a response to what Virilio calls the “chrono-pollution” of modern life – a way of slowing down time, of creating a space where the relentless pace of the world can be momentarily suspended. The music’s slow, deliberate rhythms and expansive soundscapes offer a counterpoint to the frenetic speed of contemporary existence, allowing listeners to step outside the flow of time and find a moment of stillness.PlayThe theft of sleepBut why now? Why has this genre emerged and gained such popularity in recent years? To answer this, we must turn to the broader cultural and economic forces at play. In his book24/7: Late Capitalism and the Ends of Sleep, Jonathan Crary argues that sleep is one of the last remaining frontiers of human existence that has not been fully colonised by capitalism.“Sleep is an uncompromising interruption of the theft of time from us by capitalism,” he writes. In a world where every waking moment is commodified – where our attention is constantly being harvested, monetised, and sold –sleep represents a form of resistance. It is a time when we are, at least temporarily, beyond the reach of the market.Yet, as Crary notes, even sleep is under assault. The rise of insomnia as a widespread condition can be seen as a symptom of this assault. In a 24/7 world, where the boundaries between work and leisure, public and private, have been eroded, sleep becomes increasingly elusive. The attention economy demands that we remain perpetually awake, perpetually connected, perpetually consuming. And when we do manage to sleep, it is often with the aid of technology – whether it be sleep-tracking apps, white noise machines, or, yes, post-apocalyptic ambient music.PlayWilliam Davies, in his bookNervous States: How Feeling Took Over the World, provides a compelling framework for understanding this phenomenon. Davies argues that we are living in an era where the boundaries between reason and emotion, fact and feeling, have become increasingly blurred.“The modern world,” he writes, “is one in which feelings are increasingly dominant, not just in politics but in all areas of life.” In this context, post-apocalyptic ambient music can be seen as a reflection of our collective nervous state a world where anxiety and uncertainty have become the dominant emotions.The music, with its haunting soundscapes and eerie melodies, taps into these feelings, offering a way to process and make sense of them.Cultural imaginary of the ApocalypseThe (addictive) popularity of post-apocalyptic ambient music also speaks to our cultural fascination with the end of the world. From Hollywood blockbusters likeMad Max: Fury RoadandThe Roadto TV series likeThe Walking Dead, the apocalypse has become a dominant theme in contemporary American media.This fascination is not new – nuclear anxiety has been a part of the cultural imaginary since the Cold War – but it has taken on new forms in the 21st century. Today, the apocalypse is no longer just a distant threat; it is a lived reality for many, whether in the form of climate change, political instability or live-streamed genocide.In this context, post-apocalyptic ambient music can be seen as a form of cultural expression, a way of grappling with the uncertainties and anxieties of our time. It is a music of survival, not just in the literal sense of surviving a nuclear winter, but in the broader sense of surviving the emotional and psychological toll of living in a world that often feels on the brink of collapse.The Cold War era, with its pervasive fear of nuclear annihilation, gave rise to a similar cultural preoccupation with the apocalypse. Films likeDr StrangeloveandThe Day Aftercaptured the collective anxiety of the time, while songs like Vera Lynn’sWe’ll Meet Againbecame haunting reminders of the fragility of human existence. Yet, there is a crucial difference between then and now.During the Cold War, the apocalypse was a clear and present danger, a tangible threat that could be mapped and understood. Today, the apocalypse is more diffuse, more abstract – a looming spectre that takes on different forms depending on who you ask. Post-apocalyptic ambient music reflects this shift, offering not a specific vision of the end, but a general sense of unease, a feeling that something is deeply wrong, even if we cannot quite put our finger on what it is.PlayThe paradox of fear and comfortAnd yet, there is a paradox at the heart of this phenomenon. How can something so terrifying – the thought of nuclear winter, the end of civilisation – become a source of comfort? Perhaps it is because, in the face of such overwhelming fear, we seek out narratives and sounds that allow us to make sense of the chaos.The post-apocalyptic soundscape offers a kind of order amidst the disorder, a way of imposing structure on the unimaginable. In this sense, it is not so different from the lullabies and bedtime stories we use to soothe children to sleep. Both serve to transform the unknown into something familiar, something manageable.This paradox is not unique to music. In literature, authors like Cormac McCarthy (The Road) and Octavia Butler (Parable of the Sower) have explored the ways in which the apocalypse can serve as a backdrop for stories of hope and resilience.Similarly, in film, the post-apocalyptic genre often centres on themes of survival and renewal, suggesting that even in the face of total destruction, there is the possibility of new beginnings. Post-apocalyptic ambient music taps into this same duality, offering listeners a way to confront their fears while also finding solace in the idea that, no matter how bad things get, life goes on.The sinister undercurrentBut there is a darker, more sinister undercurrent to this phenomenon. Some might argue that the rise of post-apocalyptic ambient music is not merely a cultural trend, but a form of cognitive warfare.These hours-long playlists, available for free on platforms like YouTube, could be seen as tools of perception management, designed to acclimate Western populations to the idea of a “limited nuclear war” with Russia. The notion of a “limited nuclear exchange” is, of course, a dangerous illusion. Once the codes are inserted and the missiles fly, there will be no turning back.Even if a pre-emptive decapitation strike were to take out Russian leadership, the “Dead Hand” system – a fail-safe mechanism designed to ensure retaliation – would ensure mutual destruction.PlaySleep as resistanceIn the end, the rise of post-apocalyptic ambient music as a sleep aid is a testament to the resilience of the human spirit. In a world that seeks to keep us perpetually awake, perpetually anxious, we have found ways to carve out moments of peace and rest. Whether through music, meditation, or simply turning off the lights, we continue to resist the demands of the attention economy, even if only for a few hours each night.As French philosopher Maurice Blanchot writes, the world we inhabit is “both of and after the disaster, characterised by the empty sky, in which no star or sign is visible, in which one’s bearings are lost and orientation is impossible”.In this world, sleep becomes not just a biological necessity, but an act of defiance. And perhaps, in the haunting sounds of post-apocalyptic ambient music, we find a way to navigate the emptiness, to find our bearings, and to dream of a world beyond the disaster.In the end, the rise of post-apocalyptic ambient music is not just a cultural curiosity; it is a mirror reflecting our deepest fears, our greatest hopes, and our enduring desire for peace in a world that often seems anything but peaceful.Further reading and playlistBooksJonathan Crary,24/7: Late Capitalism and the Ends of Sleep(2013)Paul Virilio,Speed and Politics(1977)Jean Baudrillard,Simulacra and Simulation(1981)Maurice Blanchot,The Writing of the Disaster(1980)Don DeLillo,White Noise(1985)Annie Jacobsen,Nuclear War: A Scenario(2024)William Davies,Nervous States: How Feeling Took Over the World Book(2018)MoviesThe Road(2009),Mad Max: Fury Road(2015),Children of Men(2006)MusicThe Disintegration Loops, William BasinskiMusic for Nine Post Cards, Hiroshi Yoshimura.We’ll Meet Again, Vera LynnZakir Kibria is a writer and nicotine fugitive, entrepreneur, chronicler of entropy and cognitive Dissident. His email address is zk@krishikaaj.com.Get the appANDROIDiOSWe welcome your comments atletters@scroll.in.MusicSleepCapitalismTrendingThe challenges of makhana’s rapidly rising appeal in indiaHomes turned to rubble, Kashmiri militants’ families question ‘collective punishment’Ramachandra Guha: In wake of Pahalgam, recalling Nehru’s advice on resisting Pakistan’s provocationsThriller: Every student in an elite Noida school is a suspect when a schoolmate is killedIndia’s complex history cannot be wished away through textbook revisions – it must be confronted"
  }
]